[
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupRaptoregg/text"
      ]
    },
    "Texts": {
      "Chs": "一颗奇异的恐龙蛋！？？！天哪！但是我想知道，我们可以用它做什么呢？",
      "Eng": "A freakin' DINOSAUR EGG?!??! Wow! What can we do with it, I wonder?"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupMethanol/text"
      ]
    },
    "Texts": {
      "Chs": "一种自然的酒精，甲醇在实验室中有着广泛的应用。你很可能想要相当数量的甲醇。最好从木材中萃取。",
      "Eng": "A natural alcohol, Methanol can be used in a variety of ways in your lab. You'll likely want a decent amount of it. You best get it from extracting wood."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupTissueculture/text"
      ]
    },
    "Texts": {
      "Chs": "在涉及基因的研究中绝不可少。培养组织打开了全新研究领域的大门。",
      "Eng": "Absolutely essential in lab work involving genetics, tissue cultures open the gate to whole new areas of experimentation."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupPlastic/text"
      ]
    },
    "Texts": {
      "Chs": "先进的塑料。多亏了这种材料，你可以在全新的分支领域进行你的研究了。你会需要相当数量的塑料的。多种些蕨树吧！",
      "Eng": "Advanced Plastic. You've opened up a whole new branch of research thanks to this helpful material. You will need quite a bit. Plant Bracken trees."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupShoggoth/text"
      ]
    },
    "Texts": {
      "Chs": "好吧……你大概不应该去碰那……可怕的生物的肉。哎呀。但我确信它一定会派上用场的。",
      "Eng": "Allright...you probably shouldn't have touched this stuff. Flesh from that hideous beast. Ew. But I am positive it will be useful."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupCalciumnitrate/text"
      ]
    },
    "Texts": {
      "Chs": "农药和化肥的另一必须原料。如果你计划建造一个有利可图，确实可行的农场，那么你会需要用到硝酸钙的。",
      "Eng": "Another essential element in pesticides and fertilizers, you'll need some of this stuff if you plan to have a profitable, viable farm."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupRawminerals/text"
      ]
    },
    "Texts": {
      "Chs": "实验室中另一种主要原料，可以简单的从绝大多数石头中通过萃取获得。请尽可能多的储存。",
      "Eng": "Another staple ingredient in the lab, raw minerals can be easily obtained from most types of stone via extraction. Stockpile as much as possible."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupBambooshoot/text"
      ]
    },
    "Texts": {
      "Chs": "你的实验室不会用到竹子，但有了竹子，你就可以建造一间漂亮的林中小屋了。",
      "Eng": "Bamboo will have little use in your lab, but it might just help you build a fancy jungle hut!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupBerlinite/text"
      ]
    },
    "Texts": {
      "Chs": "磷酸铝矿是一种经提取后可以为实验提供直接好处的矿石。你所需要做的就是把它放入萃取实验室！",
      "Eng": "Berlinite is another extractable ore that provides direct benefits to your lab work. Place in your extractor and off you go!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupBiospore/text"
      ]
    },
    "Texts": {
      "Chs": "生化孢子有着发出生物荧光的能力，因此在实验室中它们可以被便利的使用。快去试试吧！",
      "Eng": "Bio-spores have a great bioluminescent property that gives them some handy utility in your laboratory creations. Check it out!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupAlgae/text"
      ]
    },
    "Texts": {
      "Chs": "采集大量藻类的两个直接好处就是生物燃料的制作以及对有机体研究的进步。它可以使整个旅行大不相同。",
      "Eng": "Biofuel and organic research are two direct benefits to harvesting large amounts of algae. It can make all the difference in travel."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupCircuitboard/text"
      ]
    },
    "Texts": {
      "Chs": "当研发高端科技时，电路板在某种程度上不可或缺的。它可以制造令人叹服的科技设备。",
      "Eng": "Circuitboards are somewhat essential when it comes to higher-end tech. Higher-end boards produce amazing machines."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupCorvex/text"
      ]
    },
    "Texts": {
      "Chs": "粘合剂可以称得上是实验室中的奇迹。它所能做的简直超越了科学，它使那些很难处理的元素结合起来。",
      "Eng": "Corvex is sort of a laboratory miracle. It does things beyond science: it can bridge impossible elements together."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupHelium/text"
      ]
    },
    "Texts": {
      "Chs": "氦3是燃料也是能源。大量的氦3可以导致不寻常的效应，进而在研究方面取得可喜的新发现。",
      "Eng": "Helium-3 is both a fuel and energy source. It also creates an unusual effect when in large clouds, leading to hilarity in exploration."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupHydrogen/text"
      ]
    },
    "Texts": {
      "Chs": "氢气有着多方面的应用，但你会发现它在化学以及基因研究方面的",
      "Eng": "Hydrogen gas can be applied in a variety of ways, though you'll find it best suited in genetic research and chemistry."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupDnasample/text"
      ]
    },
    "Texts": {
      "Chs": "我知道这是相当常见的，但如果你想要做大量的基因研究的话，那么你也要准备大量的DNA样本。",
      "Eng": "I'm sure it is obvious, but you're going to need tons of DNA Samples if you intend on doing a serious amount of genetics research."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupMetalchunk/text"
      ]
    },
    "Texts": {
      "Chs": "将这大块金属塞进你的萃取实验室然后等待结果。我保证你会认为这是一种有用的产物。",
      "Eng": "Jam this hunk of metal into your extraction lab and see what comes out. I guarantee you'll find it useful."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupMethyliodide/text"
      ]
    },
    "Texts": {
      "Chs": "这种物质只有一个用处，那就是生产农药。使用它们可以令水培托盘生产更有价值的资源。",
      "Eng": "Methyl Iodide has but one use, and that is in the creation of pesticides. These help with hydroponics trays, producing more valuable resources."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupSpareparts/text"
      ]
    },
    "Texts": {
      "Chs": "收集混杂在一起的金属残片可能看起来很古怪…除非是为了提取其中的钨。试试吧！",
      "Eng": "Miscellaneous pieces of metal may seem odd to collect until you consider the tungsten they can be extracted for. Try it. You'll see!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupMutaviskthread/text"
      ]
    },
    "Texts": {
      "Chs": "由飞螳丝绸编织而成的线，随时可用于实验室当中。它所制成的产品会令你满意的。",
      "Eng": "Mutavisk silk woven into thread, ready for application in the lab. I think you'll be pleased with what it can do for you."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupNitrogen/text"
      ]
    },
    "Texts": {
      "Chs": "氮气可以在任何地方大量的收集，当然了，如果你没有找错地方的话。在研究中你会需要大量的氮气的。",
      "Eng": "Nitrogen can be found in abundance all over the place if you know where to look. You'll want a fair amount of it in your research."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupBlobbushjelly/text"
      ]
    },
    "Texts": {
      "Chs": "腐泥是一种稀有且令人恶心的素材。但无论如何，你会发现它在化学方面少数极为有趣的用途。",
      "Eng": "Putrid Slime is rare, and really quite gross. But, you'll find it has a few rather interesting uses through chemistry."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupNutrientpaste/text"
      ]
    },
    "Texts": {
      "Chs": "由小型食物样本制成的生糊状物。它是实验室的主要原料，你会需要大量这种物质的。",
      "Eng": "Raw, untarnished paste created from small samples of material. This is a staple in every lab, and you'll go through a ton of it."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupResin/text"
      ]
    },
    "Texts": {
      "Chs": "树脂是一种主要应用于保护装置制作的坚硬物质。",
      "Eng": "Resin is a hard substance that has applications primarily in protective gear."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupSalt/text"
      ]
    },
    "Texts": {
      "Chs": "盐是一种大量存在的物质，尤其在水中。作为原料可以在绝大多数科学分支领域应用。",
      "Eng": "Salt is quite abundant (especially in water) and applied as a resource in numerous scientific branches."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupSaltpeter/text"
      ]
    },
    "Texts": {
      "Chs": "硝酸盐可以很便利的制作炸药，除此之外也可以应用于基因研究……等等方面。",
      "Eng": "Saltpeter is handy for explosives, and can be utilized in gene research and more besides."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupSilicon/text"
      ]
    },
    "Texts": {
      "Chs": "硅有着广泛的应用，尽管我们主要将其用于制造高科技设备，比如微芯片。多储备一些，你会用上他们的。",
      "Eng": "Silicon has a range of uses, though for our purposes it will be used for technological devices such as microchips. Get more, you'll need it."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupSilk/text"
      ]
    },
    "Texts": {
      "Chs": "蚕丝是有着多种应用的高质量纤维。",
      "Eng": "Silk is a high quality textile that has many useful applications."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupGreenslime/text"
      ]
    },
    "Texts": {
      "Chs": "史莱姆黏液看起来没什么用，直到你确实在实验室用到了它们。想象一下，史莱姆制成的盔甲？可能会很方便呢……",
      "Eng": "Slimey goop may not seem useful, until you actually use some in a lab. Imagine, armor made of slime? It might come in handy..."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupMineralsample/text"
      ]
    },
    "Texts": {
      "Chs": "仅限于实验室使用，尽管如此，矿物样本仍然是不可或缺的。缺少它意味着你无法生产种植更高级的植物。",
      "Eng": "Strictly for lab use, mineral samples none the less prove to be essential. Without them you'll be unable to produce advanced plant life."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupMutavisksilk/text"
      ]
    },
    "Texts": {
      "Chs": "极其坚韧，同时有着极好的可塑性。还有着对大多数类型的辐射完全的抗性。你应该已经发现它在制作盔甲时装方面的优势了吧？",
      "Eng": "Super tough, super malleable and utterly resistant to radiation of almost all sorts. Can you see how this is useful in clothing and armor?"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupMagnesiumpowder/text"
      ]
    },
    "Texts": {
      "Chs": "镁粉可以用于制造先进的遗传因子，又或者是活化通常情况下极其稳定的粒子。",
      "Eng": "Take this magnesium powder and use it to create advanced genes, or to help destabilize otherwise completely stable particles."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupPesticide/text"
      ]
    },
    "Texts": {
      "Chs": "相信我，这一桶农药绝不是为了饮用而制的。事实上，它的味道相当糟糕。但是有了它，你就可以栽种培育优质的作物了。",
      "Eng": "This barrel of pesticide is not for drinking. Trust me. Tastes awful. But you can use it in the creation and growth of amazing plants!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupGeneticmaterial/text"
      ]
    },
    "Texts": {
      "Chs": "这种基因材料将会被证明是实验室所不可或缺的。",
      "Eng": "This sample of genetic material will prove to be an absolute necessity in your laboratory."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupAgaranichor/text"
      ]
    },
    "Texts": {
      "Chs": "这是自然存在的某种古怪的真菌，有着可以粘附在一切有机物上的能力。",
      "Eng": "This strange substance is fungal in nature, with a sort of sticky property that adheres to any organic matter."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupEndomorphicJelly/text"
      ]
    },
    "Texts": {
      "Chs": "这种物质相当诡异，但可以被相对容易的塑形。这意味着由它所制成的的武器、盔甲、装备可以称得上是最诡异的。",
      "Eng": "This stuff is bizarre, but can be shaped very specifically with relative ease. This means weapons, armor and equipment of a most odd sort."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupBlisterextract/text"
      ]
    },
    "Texts": {
      "Chs": "事实上这东西相当令人反感。在提纯之前，它闻起来就像排泄物，但有着许多特殊的用途。",
      "Eng": "This stuff is quite repulsive, actually. Blister Extract stinks like excrement before refinement, but has many exceptional uses."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupShadowgas/text"
      ]
    },
    "Texts": {
      "Chs": "这种邪恶的气体会减弱你的行动能力，同时对心理健康以及免疫系统造成长期的损害。",
      "Eng": "This vile gas really screws up your movement ability within it, and can cause long-term damage to the psyche and immune system."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupLaboil/text"
      ]
    },
    "Texts": {
      "Chs": "将这桶油放入你的萃取实验室以增加你的石油储量。",
      "Eng": "Toss this barrel of oil into an extractor to bolster your current stores of crude."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/fuArtifact/text"
      ]
    },
    "Texts": {
      "Chs": "哇…..好吧。这是一种古老的技术，它似乎直接进入到任何接触它的界面。它会教你一些古老的知识！",
      "Eng": "Wha...I...Okay then. This is some sort of ancient technology, and it appears to interface directly into whatever touches it. It teaches ancient knowledge!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupNodule/text"
      ]
    },
    "Texts": {
      "Chs": "这是什么鬼东西？也许我们应该在实验室分析一下…我有把握这能够制成一些令人不悦的东西。",
      "Eng": "What the heck is this thing? We should probably bring it to the lab to try it out. I bet it does something gross!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupOxygen/text"
      ]
    },
    "Texts": {
      "Chs": "人人都爱氧气，没错吧？没人能离开氧气！逛一逛你的实验室就会发现氧气还有许多其他用途！",
      "Eng": "Who doesn't love oxygen, am I right? Breathing is great! But oxygen has many other uses. Poke around in your lab and see."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupIodine/text"
      ]
    },
    "Texts": {
      "Chs": "有了碘，石墨烯、甲基碘、细胞材料都能够被相对容易的制作。我会尽可能多的收集它们的。",
      "Eng": "With iodine handy, graphene, methyl iodide and cell material become relatively simple to produce. I'd collect as much as you can."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupLeather/text"
      ]
    },
    "Texts": {
      "Chs": "有了皮革，你就可以将你的盔甲装饰起来。除此之外，在雨天你大概会想要一些皮革……",
      "Eng": "With leather, you can fashion some wonderful protection from harm or the elements. You'll probably want a bit of this for a rainy day."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupFertilizer/text"
      ]
    },
    "Texts": {
      "Chs": "缺少肥料的情况下，栽种培育作物都将变得十分困难。在水培托盘中使用将会极其有效！",
      "Eng": "Without fertilizer you'll have a tougher time making and growing plants. It is especially useful in a Hydroponics tray!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupAmmoniumsulfate/text"
      ]
    },
    "Texts": {
      "Chs": "在你的实验室中，你将会需要大量的硫酸铵，没有它，你将无法生产高品质的肥料！",
      "Eng": "You'll need a fair amount of Ammonium Sulfate in your lab work. Without it you'll be unable to produce high-quality fertilizers!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_resources.radiomessages": [
        "/pickupBone/text"
      ]
    },
    "Texts": {
      "Chs": "你找到了一些骨头。尽管有些可怕又有些古老……但它仍能用于生产许多有用的产品，比如说，武器盔甲以及骨粉。",
      "Eng": "You've found some bone. While somewhat grisly and primitive it can still produce various useful goods including weapons and armor."
    }
  }
]