[
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_chemlab.radiomessages": [
        "/pickupMutagene2/text"
      ]
    },
    "Texts": {
      "Chs": "包裹在某种液体...中的不规则的基因结构。让我们把它放到基因研究项目中去吧！",
      "Eng": "Erratic gene-constructs encased in liquefied... something. Let's jam it into a gene-research project!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_chemlab.radiomessages": [
        "/pickupMutagene4/text"
      ]
    },
    "Texts": {
      "Chs": "仅凭一眼我就可以告诉你，这种诱变剂有着极为致命的毒素，我建议你别直接触摸它，天知道除了有毒之外，这种物质还有着什么可怕的危害。",
      "Eng": "I can tell at a glance that this mutagen will prove lethal if you touch it. It has high-potency toxins and who knows what else?"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_chemlab.radiomessages": [
        "/pickupMulch/text"
      ]
    },
    "Texts": {
      "Chs": "护根不仅可以保护植物根茎，同样也是一种低效肥料。你可以把它放入托盘中，以提高作物产量和生长速度。",
      "Eng": "Mulch has one single purpose: Low-grade fertilizer. Toss it into a Hydroponics Tray to increase crop yields and growth speed."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_chemlab.radiomessages": [
        "/pickupMutagene1/text"
      ]
    },
    "Texts": {
      "Chs": "这个奇怪诱变物质在样品瓶中不断旋转。我觉得你应该留着，说不定什么时候就可以派上大用场。",
      "Eng": "Strange mutagenic material swirling in your sample jar. Surely we can use this somehow."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_chemlab.radiomessages": [
        "/pickupAliencompound/text"
      ]
    },
    "Texts": {
      "Chs": "这种化合物的遗传密码里具有各种未知的分子。我们应该继续研究它到底能够起到什么作用。",
      "Eng": "This strange alien compound has various unknown elements within its genetic coding. We should see what it can do in the lab."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_chemlab.radiomessages": [
        "/pickupMorphite/text"
      ]
    },
    "Texts": {
      "Chs": "通过你完美的化学调试，你创造出了一种全新的金属物质。让我们把它称为：异极合金！我敢说这种新金属一定棒极了！",
      "Eng": "Using your chemistry mastery you have managed to create a whole new type of metal. We shall call it: Morphite. I bet it's awesome, since you made it."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_chemlab.radiomessages": [
        "/pickupUnstableparticles/text"
      ]
    },
    "Texts": {
      "Chs": "不稳定粒子是一种非常有用的高科技材料，可以利用它来造出各种先进的科研设备。",
      "Eng": "What we have here in Unstable Particles is a very useful and advanced material capable of creating extremely advanced machines and equipment."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_chemlab.radiomessages": [
        "/pickupMutagene3/text"
      ]
    },
    "Texts": {
      "Chs": "这种物质闻起来就像熊猫和水果，但是千万别吃，因为它会腐蚀所有与它接触的有机物质！",
      "Eng": "Whatever this is, it smells like pandas and fruit, yet erodes all organic matter it touches. Don't eat it."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "radiomessages/fu_chemlab.radiomessages": [
        "/pickupCorruptionseed/text"
      ]
    },
    "Texts": {
      "Chs": "你已经成功地将腐化生物质诱变成一种新的矿物。我想知道它能做什么呢？",
      "Eng": "You've successfully mutated raw corruption into a useable sort of ore. I wonder what it can do?"
    }
  }
]