[
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/description"
      ]
    },
    "Texts": {
      "Chs": "很好的信息来源。",
      "Eng": "A good source of information."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/9"
      ]
    },
    "Texts": {
      "Chs": "随机生成的武器基本上都弱于你自己制作的武器。 手工制作的武器一般也有为补强武器而设计的特殊能力。",
      "Eng": "A randomly-generated weapon will almost always be weaker than one you've crafted yourself. Crafted weapons also generally have special abilities designed to complement the weapon."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/31"
      ]
    },
    "Texts": {
      "Chs": "不说第二遍：凯文是一个天才，他确实是。聪明绝顶。 但是，我绝对肯定确定他有点魔怔。去读一下违规日志，你就会很快地理解我现在说的。",
      "Eng": "A second reminder: Kevin is a genius, he really is. Super smart. However, I am absolutely certain he is at least a little bit insane. Read the infraction log, and you'll very swiftly understand what I mean."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/28"
      ]
    },
    "Texts": {
      "Chs": "显然，许多且声称有另一个比古人更古老的种族，但对没几个人星际历史的那个时期有所了解。它已经消失在时间中了。",
      "Eng": "Apparently, many Peglaci claim that there was another race even older than the Ancients, but not much is known about that time period of galactic history. It has been lost to time."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/46"
      ]
    },
    "Texts": {
      "Chs": "回到主题，我想：科学前哨站的市场有一大堆超级有用的东西，能让你的生活更加的便捷。你应该去看看。",
      "Eng": "Back on topic, I guess: The market here at the science outpost has a whole bunch of super-useful stuff you can purchase to help make your life a little easier. You should check it out."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/10"
      ]
    },
    "Texts": {
      "Chs": "你可以考虑使用计算机将随机生成的武器转化为研究点数！你会发现这很有，特别是对于高价值的武器。同样的方法也适用于物体和物品。",
      "Eng": "Consider using a computer to turn randomly-generated weapons into research, instead! It can prove to be quite useful, especially with more valuable weapons. This applies to objects and items as well."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/34"
      ]
    },
    "Texts": {
      "Chs": "你知道吗，有一次他从一个富有的投资者那里获得了3万亿像素的捐款，仅仅是因为，正如他继续声称的那样，他为这个人做了一个非常好的三明治。有那么好的三明治吗？我持怀疑态度。",
      "Eng": "Did you know that one time he obtained a 3-trillion pixel donation from a wealthy investor solely because, as he went on to claim, he made a really good sandwich for the man. Is any sandwich that good? I am sceptical."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/13"
      ]
    },
    "Texts": {
      "Chs": "敌人看起来几乎无敌？它可能只是对你所造成的伤害类型有抵抗力。试着用不同的武器造成不同属性的伤害，以找到弱点!",
      "Eng": "Does an enemy seem almost invincible? It might just be resistant to the damage type you're using. Try switching things up with different weapons to find a weakness!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/25"
      ]
    },
    "Texts": {
      "Chs": "不喜欢用传送器降落到到你正在绕轨运行的星球吗？在你的飞船外面下到足够远的地方，你就会坠落到下面的星球上!",
      "Eng": "Don't feel like using the teleporter to descend to the planet you're orbiting? Go down far enough outside your ship, and you'll fall to the planet below!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/14"
      ]
    },
    "Texts": {
      "Chs": "不知道在哪里能找到一个特定的项目或材料？实验室目录可以告诉你它是否是你附近任何机器的输出物。如果这也不行，请查阅主菜单上显示的官方维基!",
      "Eng": "Don't know where to find a specific item or material? A Lab Directory can tell you if it's an output from any of your nearby machines. If that fails, check the official wiki displayed on the main menu!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/45"
      ]
    },
    "Texts": {
      "Chs": "赣哦！这也太奇怪了，对不起。请不要见怪。这是我最不愿意做的事情！",
      "Eng": "Eek! That's far too personal, sorry. Please, don't take offense. That's the last thing I wanted to do!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/15"
      ]
    },
    "Texts": {
      "Chs": "即使是食肉动物也有理由建造植物农场 - Frackin' Universe增加的许多可种植的植物可以被任何人食用。",
      "Eng": "Even carnivores have a reason to set up plant farms - many of the growable plants that Frackin' Universe adds can be eaten by anyone."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/50"
      ]
    },
    "Texts": {
      "Chs": "耳廓狐很可爱。我相当肯定这就是他们严重的排外种族主义被容忍的唯一原因。它们太可爱了，不能不爱！只要听他们谈论昆虫类，你就会明白。",
      "Eng": "Fenerox are adorable. I'm fairly sure this is the only reason their acute xenophobic racism is tolerated. It's too cute to not love! Just listen to them talk about insectoids, and you'll understand."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/1"
      ]
    },
    "Texts": {
      "Chs": "首先，我建议你看一下Frackin' Universe的指南 - 你的船柜里应该有一套，但为了以防万一，在这栋楼西侧附近的书架上也有一套。",
      "Eng": "First things first, I'd recommend you take a look at the Frackin' Universe guide codexes - you should have a set of them in your ship's locker, but just in case, there's also a set of them in a bookshelf near the west side of this building."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/16"
      ]
    },
    "Texts": {
      "Chs": "例如，肉串是肉食动物的一个可靠的营养来源。甭管它是植物，它的球茎上却还是能长出生肉。",
      "Eng": "For example, Meatvine is a reliable source of nutrition for carnivores. Nevermind the fact that a plant is growing raw meat from its bulbs."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/11"
      ]
    },
    "Texts": {
      "Chs": "有一套最喜欢的武器或盔甲套装，而你不想随着你的游戏进展将其遗弃？好消息--你不必这样做! 使用你三度仪中的的升级功能。",
      "Eng": "Have a favorite weapon or armor set that you don't want to leave behind as you progress? Good news - you don't have to! Using your Tricorder's Upgrade function."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/6"
      ]
    },
    "Texts": {
      "Chs": "在获得研究点数的方面有困难？你玩的时间越长，你的被动研究收益就越高。",
      "Eng": "Having trouble gaining research? Your passive research gain will increase the longer you play."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/5"
      ]
    },
    "Texts": {
      "Chs": "难以保持你的船的油箱充盈？请记住，厄尔吉斯并不是你唯一可以使用的燃料 - 同位素、生物燃料，甚至是氢气都可以作为燃料来源 - 而且有些燃料比其他的更有效！",
      "Eng": "Having trouble keeping your ship's tank topped up? Remember, Erchius isn't the only fuel you can use - Isotopes, bio-fuels, and even Hydrogen can all act as fuel sources - and some are more effective than others!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/32"
      ]
    },
    "Texts": {
      "Chs": "我是说，整个基地被唇彩涂满的事情？是的，是我先发现的。我总是第一个发现这些的。相信我--那可真是叹为观止。我仍然不确定他是如何在不到5个小时内将整个基地涂满的。每一个表面。甚至是那些重达几吨的物体后面。",
      "Eng": "I mean, the whole lip gloss thing? Yea, it was me that came across it first. I'm always the first one to show up for the day. Trust me - that was awe-inspiringly confusing. I remain uncertain of how he coated the entire base in less than 5 hours. Every surface. Even ones behind objects weighing several tons."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/4"
      ]
    },
    "Texts": {
      "Chs": "我建议尽早研究提取技术。手摇磨可能没有完整的萃取仪器那么快，但它仍然是你工具堆中最强大的工具之一。",
      "Eng": "I'd recommend researching extraction technology sooner rather than later. A Hand Mill might not be as fast as a full Extraction Lab, but it's still one of the most powerful tools in your arsenal."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/26"
      ]
    },
    "Texts": {
      "Chs": "如果我的一些建议现在对你没有意义，不要担心。你永远不知道-当其无，有器之用！",
      "Eng": "If some of my advice doesn't make sense to you right now, don't worry about it. You never know - it might come up later!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/21"
      ]
    },
    "Texts": {
      "Chs": "如果游戏看起来不对头，首先检查一下，确保你没有安装任何不兼容的mods。如果这还不行，请将你的完整日志文件发布到Frackin' Universe Discord的BUG频道上。",
      "Eng": "If things don't seem to be working right, first check to make sure you don't have any incompatible mods installed. If that doesn't work, post your full log file to the bug channel on the Frackin' Universe Discord."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/29"
      ]
    },
    "Texts": {
      "Chs": "如果你想进行交易，请前往空间站。你会发现你可以投资，玩弄市场，或雇用定制的雇佣兵，或者购买独特的医疗产品。",
      "Eng": "If you are looking to trade, head to a space station. You'll find you can invest, play the market, or hire custom mercenaries and unique medical procedures."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/27"
      ]
    },
    "Texts": {
      "Chs": "如果你曾发现有灰色砖块和紫色或蓝色石刻的外星遗迹，你可能发现了古人建造的东西，他们早已灭绝的。",
      "Eng": "If you ever find alien ruins with grey bricks and purple or blue glyphs, you've probably found something built by the Ancients, a long-extinct race."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/20"
      ]
    },
    "Texts": {
      "Eng": "Immunities and resistances are seperate - Even if you're immune to a planet's extreme heat, that won't reduce damage from fiery attacks unless you increase your heat resistance."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/35"
      ]
    },
    "Texts": {
      "Chs": "在你的旅行中，你会发现一些不寻常的秘辛。请注意，那些太过出格的东西很可能会导致一点点疯狂或精神错乱。这可能会导致各种各样的副作用（包括积极和消极的）。",
      "Eng": "In your travels, you will find some truly unusual things. Be advised that those which are too far out-there are likely to cause just a tiny bit of madness or insanity. This can cause a wide variety of side-effects (both positive and negative)."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/shortdescription"
      ]
    },
    "Texts": {
      "Chs": "万事通",
      "Eng": "Info Booth"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/52"
      ]
    },
    "Texts": {
      "Chs": "现在是午餐时间吗？只要觉得是那就是。我非常饿，而我的咖啡因严重不足。我想我很快就会去西下层的星八颗。建议：把大块肉咖啡留给食肉动物。",
      "Eng": "Is it lunch yet? If sure feels like it. I am incredibly hungry, and my coffee hole is empty. I think I'll head to the Starbucks on the lower west floor soon. Advice: leave the Chunky Meat Coffee for the carnivores."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/40"
      ]
    },
    "Texts": {
      "Chs": "不用说，科学前哨站市场处的“肉店”在出售一些相当...道德层面有问题的商品，理智的人可能会明智地避免。",
      "Eng": "It should go without saying, but the 'meat shop' in the market here at the Science Outpost sells some rather...morally questionable wares that sane folk would probably be wise to avoid."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/48"
      ]
    },
    "Texts": {
      "Chs": "凯文对你随意进入他的办公室使用他的验尸台完全没有意见。这让人相当不放心。有时你可以在午餐室里听到挤压的声音。",
      "Eng": "Kevin has absolutely no issue with you randomly dropping into his office to use his autopsy table. This is rather unsettling. Sometimes you can hear the squishing sounds in the lunch room."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/24"
      ]
    },
    "Texts": {
      "Chs": "如果没有背景阻隔，液体就会流走 - 尽管海洋是一个例外。",
      "Eng": "Liquids will drain away if there's not a background block keeping them there - though oceans are an exception."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/3"
      ]
    },
    "Texts": {
      "Chs": "看起来你的大部分守护团制造数据库在某个时候被打乱了- 你需要用你的三度仪来研究如何制作很多的其他东西。",
      "Eng": "Looks like most of your Protectorate crafting databanks have been scrambled at some point - You'll need to use your Tricorder to research how to craft a lot of things."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/41"
      ]
    },
    "Texts": {
      "Chs": "机甲可能很笨重，但从长远来看，它们相当有用。一台配备了飞行模式的步行坦克，可以用巨大的枪支摧毁整个大面积的敌人，你会嫌多吗？",
      "Eng": "Mechs might be beefy and cumbersome but long-term they are quite useful. Why wouldn't you want a walking tank equipped with a flight mode that can decimate entire swathes of enemies with huge guns?"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/23"
      ]
    },
    "Texts": {
      "Chs": "混合某些液体会产生意想不到的结果 - 做对了，你就可以制造出更多的几乎任何液体！",
      "Eng": "Mixing certain liquids can have unexpected results - do things right, and you can make more of almost any liquid!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/19"
      ]
    },
    "Texts": {
      "Chs": "大多数危险的环境影响可以通过对该影响的免疫来预防，或者通常通过对特定的伤害类型有足够高的抵抗力来预防。",
      "Eng": "Most hazardous environmental effects can be prevented with either an immunity to that effect, or often through a high enough resistance to specific damage types."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/17"
      ]
    },
    "Texts": {
      "Chs": "大多数植物和它们的种子都可以被提取成有用的材料！它们在各种情况下都能带来好处。多尝试广实验!",
      "Eng": "Most plants and their seeds can be extracted into useful materials! They can be a benefit in a wide array of circumstances. Experiment and try many!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/38"
      ]
    },
    "Texts": {
      "Chs": "整个宇宙中我最喜欢的东西可能是鱼。好吃。不过，紧随其后的是暗光花。就个人而言，我认为没有任何植物比它更美丽，更令人神往。",
      "Eng": "My favorite thing in the entire universe is probably fish. Yum. A close second, though, is the Darklight Flower. Personally, I don't think any flora is more beautiful and haunting."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/49"
      ]
    },
    "Texts": {
      "Chs": "我的指甲？ 哦谢谢！^red;*脸红*。^reset;我大部分时间几乎无事可做，所以我在任何一天基本上都花3个小时为自己做准备。我认为这是有回报的。你不觉得吗？",
      "Eng": "My fingernails? Oh, thanks! ^red;*blush*^reset;. I have pretty much nothing to do most of the time, so I spent essentially 3 hours on any given day preeing myself. I think it pays off. Don't you?"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/51"
      ]
    },
    "Texts": {
      "Chs": "无论他要求多少次，都不要和凯文去“好玩的小镇”。它既不有趣，也不是一个小镇。最好听话，否则你可能会像我一样：被绑在办公室的墙上，对着风扇大喊大叫。",
      "Eng": "No matter how many times he asks, do not go with Kevin to 'Fun Town'. It is neither fun, nor a town. Just heed the advice, or you might end up like me: taped to a wall in an office screaming obscenities into a fan."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/42"
      ]
    },
    "Texts": {
      "Chs": "当然，你需要自己制作它，但这没关系。为了获得额外的保护和力量，这些努力完全值得。",
      "Eng": "Of course, you'll need to craft it yourself, but that's okay. Totally worth the effort for the extra protection and power."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/8"
      ]
    },
    "Texts": {
      "Chs": "好吧，有几个同事说他们要离开去生恰一点加布林，我问他们那是什么意思，他们看着我，好像我是个白痴。这正常吗？我是那个不知道那是什么意思的怪人吗？",
      "Eng": "Okay, so a couple of coworkers were saying they were leaving to go snarsh some garflipps, and I asked them what that meant, and they looked at me like I was an idiot. Is that normal? Am I the weird one for not knowing what that means?"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/7"
      ]
    },
    "Texts": {
      "Chs": "研究点数也将根据你所在星球的等级而增加 - 探索更危险的星球可以让你更快地收集研究资料！",
      "Eng": "Research will also increase based on the tier of the planet you're on - Exploring more dangerous planets lets you gather research more quickly!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/2"
      ]
    },
    "Texts": {
      "Chs": "那些手抄本中的一些信息现在看来可能并不相关，但即使是我们一些资深的研究人员也通过这些书学到了一些他们不知道的东西，所以最好留一份心眼！",
      "Eng": "Some of the information in those codexes might not seem relevant right now, but even some of our veteran researchers have learned something they didn't know through those books, so keep them in mind!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/18"
      ]
    },
    "Texts": {
      "Chs": "很抱歉，我们不能让你使用大部分的制造和加工机器 - 在凯文试图用它们来制造一把可以射出更小自己的枪之后，我们不得不限制它们的使用。",
      "Eng": "Sorry we can't let you use most of the crafting and processing machines - We had to restrict access after Kevin tried to use them to create a gun that shot smaller versions of itself."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/43"
      ]
    },
    "Texts": {
      "Chs": "对不起，我只是有时太健谈了，我发誓。我不是故意的，但很少有人真的和我谈这么久。我开始怀疑，这里面有更深一层的含义。你对水里出生的女人会有想法吗？",
      "Eng": "Sorry, I am just too loquacious for my own good sometimes, I swear. I don't mean to be, but it isn't often that someone actually talks to me for this long. I'm starting to wonder if maybe there's more to it. Do you have a thing for aquatic women?"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/33"
      ]
    },
    "Texts": {
      "Chs": "可以说，我们对凯文有一种爱恨交加的关系。他确实在资金、采购和捐款方面带来了相当大的收入，尽管不知道是通过什么手段完成的，也无法解释。",
      "Eng": "Suffice it to say, we have a love-hate relationship with Kevin. He does bring in a rather large amount of income in funding, purchases -and- donations, though the means through which even this is accomplished defy explanation."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/22"
      ]
    },
    "Texts": {
      "Chs": "慢慢来--如果你急于尽快推进，你会错过各种有趣的东西--比如这些提示！",
      "Eng": "Take your time - if you rush to advance as fast as possible, you'll miss all sorts of fun things - like these hints!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/30"
      ]
    },
    "Texts": {
      "Chs": "鼠人还在这些空间站中的每一个地方设立了专门的区域。不过，我无法告诉你里面有什么。要想进入，需要专门的权限。",
      "Eng": "The Kirhosi also have set up special sections on each one of these space stations. I couldn't tell you what is inisde them, though: Specialized access is required in order to enter."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/0"
      ]
    },
    "Texts": {
      "Chs": "欢迎来到科学^green;前哨站^reset;！维纳利斯的任何朋友都是我们的朋友。 如果您需要一些建议，就我在这里！ 对了.....最好远离凯文。",
      "Eng": "Welcome to the ^green;Science Outpost^reset;! Any friend of Vinalisj is a friend of ours. If you need some advice, I'm here! Just... try to stay away from Kevin."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/39"
      ]
    },
    "Texts": {
      "Chs": "当我在这张桌子上感到无聊的时候，我往往会说一点话。有人甚至会说太多了。我只是不停地唠叨，不停地唠叨......如果有什么有趣的事情可以做，我就不会那么无聊了。",
      "Eng": "When I get bored at this desk, I tend to talk a little bit. Some might even say too much. I just drone on, and on, and on...I'd be less bored if there was anything fun to do."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/47"
      ]
    },
    "Texts": {
      "Chs": "不过，当你--做--检查时，也许要穿裤子。凯文有一个习惯，在他早上穿衣服之前就去购物。如果不是因为他的外壳......好吧，我们只能说周围会有太多的外星人翅膀。",
      "Eng": "When you -do- check it out, though, maybe wear pants. Kevin has a habit of shopping before he even gets dressed in the morning. If it wasn't for his carapace...well, let's just say there would be entirely too much alien wing-wong around."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/36"
      ]
    },
    "Texts": {
      "Chs": "当你受到这种疯狂的折磨时，你应该去我们左边的虚拟弗洛伊德里坐一坐。那件别致的设备本质上是一个人工智能驱动的心理学家，因其能够修复最折磨人心的的精神床上而闻名，前提是花上足够的时间。",
      "Eng": "When you are suffering from this madness, you should go ahead and have a seat in the InstaFreud to the left of us. That nifty device is essentially an AI-Driven Psychologist that is reknowned for its ability to fix even some of the most dramatic mental afflictions, given enough time."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/53"
      ]
    },
    "Texts": {
      "Chs": "你为什么还在这里？有个人说话是很好的，但我包揽了话匣子，而你却在听，像某位猿人傻瓜一样发出非承诺的咕哝声。",
      "Eng": "Why are you still here? It's great having someone to talk to, but I seem to be doing all of the talking while you listen and make non-commital grunts like some kind of Apex simpleton."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/44"
      ]
    },
    "Texts": {
      "Chs": "你并不是我喜欢的类型，但你身上确实有一些我无法完全定义的东西，我觉得很有趣。甚至引人注目。也许是你的香气。",
      "Eng": "You aren't really my type, but there is certainly something about you that I can't quite define that I find interesting. Compelling, even. Maybe its your aroma."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/12"
      ]
    },
    "Texts": {
      "Chs": "你可以使用升级模块来改进几乎所有的Frackin' Universe武器或盔甲。只要这样你就可以确保任何盔甲或武器都能保持有用的状态！",
      "Eng": "You can use Upgrade modules to improve almost all Frackin' Universe weapons or armor. By doing this, you can ensure that any armor or weapon stays viable!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/37"
      ]
    },
    "Texts": {
      "Chs": "^red;不要^reset;使用凯文牌死亡科技罐头。它对你做的正是它在罐子上说的事。这可能不是你的愿望。这也肯定不是先生德门托的愿望，他是尼潘戈IV上受人尊敬的哑剧演员。他无视警告。所以现在他已经死了。所以，说的是你。小心点。",
      "Eng": "^red;Do not^reset; use Kevins Kill-Pod technology. It does to you exactly what it says on the tin. This is likely not your desire. It sure wasn't the desire of Dr.Demento, revered Mime of Nippango IV. He ignored the warning. Now he's dead. So yea. Careful."
    }
  }
]