[
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/description"
      ]
    },
    "Texts": {
      "Eng": "A good source of information."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/9"
      ]
    },
    "Texts": {
      "Eng": "A randomly-generated weapon will almost always be weaker than one you've crafted yourself. Crafted weapons also generally have special abilities designed to complement the weapon."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/31"
      ]
    },
    "Texts": {
      "Eng": "A second reminder: Kevin is a genius, he really is. Super smart. However, I am absolutely certain he is at least a little bit insane. Read the infraction log, and you'll very swiftly understand what I mean."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/28"
      ]
    },
    "Texts": {
      "Eng": "Apparently, many Peglaci claim that there was another race even older than the Ancients, but not much is known about that time period of galactic history. It has been lost to time."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/46"
      ]
    },
    "Texts": {
      "Eng": "Back on topic, I guess: The market here at the science outpost has a whole bunch of super-useful stuff you can purchase to help make your life a little easier. You should check it out."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/10"
      ]
    },
    "Texts": {
      "Eng": "Consider using a computer to turn randomly-generated weapons into research, instead! It can prove to be quite useful, especially with more valuable weapons. This applies to objects and items as well."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/34"
      ]
    },
    "Texts": {
      "Eng": "Did you know that one time he obtained a 3-trillion pixel donation from a wealthy investor solely because, as he went on to claim, he made a really good sandwich for the man. Is any sandwich that good? I am sceptical."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/13"
      ]
    },
    "Texts": {
      "Eng": "Does an enemy seem almost invincible? It might just be resistant to the damage type you're using. Try switching things up with different weapons to find a weakness!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/25"
      ]
    },
    "Texts": {
      "Eng": "Don't feel like using the teleporter to descend to the planet you're orbiting? Go down far enough outside your ship, and you'll fall to the planet below!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/14"
      ]
    },
    "Texts": {
      "Eng": "Don't know where to find a specific item or material? A Lab Directory can tell you if it's an output from any of your nearby machines. If that fails, check the official wiki displayed on the main menu!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/45"
      ]
    },
    "Texts": {
      "Eng": "Eek! That's far too personal, sorry. Please, don't take offense. That's the last thing I wanted to do!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/15"
      ]
    },
    "Texts": {
      "Eng": "Even carnivores have a reason to set up plant farms - many of the growable plants that Frackin' Universe adds can be eaten by anyone."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/50"
      ]
    },
    "Texts": {
      "Eng": "Fenerox are adorable. I'm fairly sure this is the only reason their acute xenophobic racism is tolerated. It's too cute to not love! Just listen to them talk about insectoids, and you'll understand."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/1"
      ]
    },
    "Texts": {
      "Eng": "First things first, I'd recommend you take a look at the Frackin' Universe guide codexes - you should have a set of them in your ship's locker, but just in case, there's also a set of them in a bookshelf near the west side of this building."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/16"
      ]
    },
    "Texts": {
      "Eng": "For example, Meatvine is a reliable source of nutrition for carnivores. Nevermind the fact that a plant is growing raw meat from its bulbs."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/11"
      ]
    },
    "Texts": {
      "Eng": "Have a favorite weapon or armor set that you don't want to leave behind as you progress? Good news - you don't have to! Using your Tricorder's Upgrade function."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/6"
      ]
    },
    "Texts": {
      "Eng": "Having trouble gaining research? Your passive research gain will increase the longer you play."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/5"
      ]
    },
    "Texts": {
      "Eng": "Having trouble keeping your ship's tank topped up? Remember, Erchius isn't the only fuel you can use - Isotopes, bio-fuels, and even Hydrogen can all act as fuel sources - and some are more effective than others!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/32"
      ]
    },
    "Texts": {
      "Eng": "I mean, the whole lip gloss thing? Yea, it was me that came across it first. I'm always the first one to show up for the day. Trust me - that was awe-inspiringly confusing. I remain uncertain of how he coated the entire base in less than 5 hours. Every surface. Even ones behind objects weighing several tons."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/4"
      ]
    },
    "Texts": {
      "Eng": "I'd recommend researching extraction technology sooner rather than later. A Hand Mill might not be as fast as a full Extraction Lab, but it's still one of the most powerful tools in your arsenal."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/26"
      ]
    },
    "Texts": {
      "Eng": "If some of my advice doesn't make sense to you right now, don't worry about it. You never know - it might come up later!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/21"
      ]
    },
    "Texts": {
      "Eng": "If things don't seem to be working right, first check to make sure you don't have any incompatible mods installed. If that doesn't work, post your full log file to the bug channel on the Frackin' Universe Discord."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/29"
      ]
    },
    "Texts": {
      "Eng": "If you are looking to trade, head to a space station. You'll find you can invest, play the market, or hire custom mercenaries and unique medical procedures."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/27"
      ]
    },
    "Texts": {
      "Eng": "If you ever find alien ruins with grey bricks and purple or blue glyphs, you've probably found something built by the Ancients, a long-extinct race."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/20"
      ]
    },
    "Texts": {
      "Eng": "Immunities and resistances are seperate - Even if you're immune to a planet's deadly heat, it won't reduce damage from fiery attacks unless you increase your heat resistance."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/35"
      ]
    },
    "Texts": {
      "Eng": "In your travels, you will find some truly unusual things. Be advised that those which are too far out-there are likely to cause just a tiny bit of madness or insanity. This can cause a wide variety of side-effects (both positive and negative)."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/shortdescription"
      ]
    },
    "Texts": {
      "Eng": "Info Booth"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/52"
      ]
    },
    "Texts": {
      "Eng": "Is it lunch yet? If sure feels like it. I am incredibly hungry, and my coffee hole is empty. I think I'll head to the Starbucks on the lower west floor soon. Advice: leave the Chunky Meat Coffee for the carnivores."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/40"
      ]
    },
    "Texts": {
      "Eng": "It should go without saying, but the 'meat shop' in the market here at the Science Outpost sells some rather...morally questionable wares that sane folk would probably be wise to avoid."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/48"
      ]
    },
    "Texts": {
      "Eng": "Kevin has absolutely no issue with you randomly dropping into his office to use his autopsy table. This is rather unsettling. Sometimes you can hear the squishing sounds in the lunch room."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/24"
      ]
    },
    "Texts": {
      "Eng": "Liquids will drain away if there's not a background block keeping them there - though oceans are an exception."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/3"
      ]
    },
    "Texts": {
      "Eng": "Looks like most of your Protectorate crafting databanks have been scrambled at some point - You'll need to use your Tricorder to research how to craft a lot of things."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/41"
      ]
    },
    "Texts": {
      "Eng": "Mechs might be beefy and cumbersome but long-term they are quite useful. Why wouldn't you want a walking tank equipped with a flight mode that can decimate entire swathes of enemies with huge guns?"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/23"
      ]
    },
    "Texts": {
      "Eng": "Mixing certain liquids can have unexpected results - do things right, and you can make more of almost any liquid!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/19"
      ]
    },
    "Texts": {
      "Eng": "Most hazardous environmental effects can be prevented with either an immunity to that effect, or often through a high enough resistance to specific damage types."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/17"
      ]
    },
    "Texts": {
      "Eng": "Most plants and their seeds can be extracted into useful materials! They can be a benefit in a wide array of circumstances. Experiment and try many!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/38"
      ]
    },
    "Texts": {
      "Eng": "My favorite thing in the entire universe is probably fish. Yum. A close second, though, is the Darklight Flower. Personally, I don't think any flora is more beautiful and haunting."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/49"
      ]
    },
    "Texts": {
      "Eng": "My fingernails? Oh, thanks! ^red;*blush*^reset;. I have pretty much nothing to do most of the time, so I spent essentially 3 hours on any given day preeing myself. I think it pays off. Don't you?"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/51"
      ]
    },
    "Texts": {
      "Eng": "No matter how many times he asks, do not go with Kevin to 'Fun Town'. It is neither fun, nor a town. Just heed the advice, or you might end up like me: taped to a wall in an office screaming obscenities into a fan."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/42"
      ]
    },
    "Texts": {
      "Eng": "Of course, you'll need to craft it yourself, but that's okay. Totally worth the effort for the extra protection and power."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/8"
      ]
    },
    "Texts": {
      "Eng": "Okay, so a couple of coworkers were saying they were leaving to go snarsh some garflipps, and I asked them what that meant, and they looked at me like I was an idiot. Is that normal? Am I the weird one for not knowing what that means?"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/7"
      ]
    },
    "Texts": {
      "Eng": "Research will also increase based on the tier of the planet you're on - Exploring more dangerous planets lets you gather research more quickly!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/2"
      ]
    },
    "Texts": {
      "Eng": "Some of the information in those codexes might not seem relevant right now, but even some of our veteran researchers have learned something they didn't know through those books, so keep them in mind!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/18"
      ]
    },
    "Texts": {
      "Eng": "Sorry we can't let you use most of the crafting and processing machines - We had to restrict access after Kevin tried to use them to create a gun that shot smaller versions of itself."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/43"
      ]
    },
    "Texts": {
      "Eng": "Sorry, I am just too loquacious for my own good sometimes, I swear. I don't mean to be, but it isn't often that someone actually talks to me for this long. I'm starting to wonder if maybe there's more to it. Do you have a thing for aquatic women?"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/33"
      ]
    },
    "Texts": {
      "Eng": "Suffice it to say, we have a love-hate relationship with Kevin. He does bring in a rather large amount of income in funding, purchases -and- donations, though the means through which even this is accomplished defy explanation."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/22"
      ]
    },
    "Texts": {
      "Eng": "Take your time - if you rush to advance as fast as possible, you'll miss all sorts of fun things - like these hints!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/30"
      ]
    },
    "Texts": {
      "Eng": "The Kirhosi also have set up special sections on each one of these space stations. I couldn't tell you what is inisde them, though: Specialized access is required in order to enter."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/0"
      ]
    },
    "Texts": {
      "Eng": "Welcome to the ^green;Science Outpost^reset;! Any friend of Vinalisj is a friend of ours. If you need some advice, I'm here! Just... try to stay away from Kevin."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/39"
      ]
    },
    "Texts": {
      "Eng": "When I get bored at this desk, I tend to talk a little bit. Some might even say too much. I just drone on, and on, and on...I'd be less bored if there was anything fun to do."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/47"
      ]
    },
    "Texts": {
      "Eng": "When you -do- check it out, though, maybe wear pants. Kevin has a habit of shopping before he even gets dressed in the morning. If it wasn't for his carapace...well, let's just say there would be entirely too much alien wing-wong around."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/36"
      ]
    },
    "Texts": {
      "Eng": "When you are suffering from this madness, you should go ahead and have a seat in the InstaFreud to the left of us. That nifty device is essentially an AI-Driven Psychologist that is reknowned for its ability to fix even some of the most dramatic mental afflictions, given enough time."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/53"
      ]
    },
    "Texts": {
      "Eng": "Why are you still here? It's great having someone to talk to, but I seem to be doing all of the talking while you listen and make non-commital grunts like some kind of Apex simpleton."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/44"
      ]
    },
    "Texts": {
      "Eng": "You aren't really my type, but there is certainly something about you that I can't quite define that I find interesting. Compelling, even. Maybe its your aroma."
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/12"
      ]
    },
    "Texts": {
      "Eng": "You can use Upgrade modules to improve almost all Frackin' Universe weapons or armor. By doing this, you can ensure that any armor or weapon stays viable!"
    }
  },
  {
    "DeniedAlternatives": [],
    "Files": {
      "objects/scienceoutpost/scienceinfobooth/scienceinfobooth.object": [
        "/chatOptions/37"
      ]
    },
    "Texts": {
      "Eng": "^red;Do not^reset; use Kevins Kill-Pod technology. It does to you exactly what it says on the tin. This is likely not your desire. It sure wasn't the desire of Dr.Demento, revered Mime of Nippango IV. He ignored the warning. Now he's dead. So yea. Careful."
    }
  }
]