[
  {
    "DeniedAlternatives": [],
    "Files": {
      "_FUversioning.config": [
        "/text"
      ]
    },
    "Texts": {
      "Eng": "\n\n  Welcome to ^green;Frackin' Universe^reset;!\n\n  _____________________________________________________\n  ^cyan;New in version 5.6.192^reset;\n  \n  * mushroom men can now be captured\n  \n  * added console category under tool 'category' for ITD\n  \n  * adds missing itemdescriptions for unique weapon tooltips\n  \n  * Telebrium, Tauntra and Neutron Orbs now count as 'energy' weapons for set bonuses\n  \n  * Chickens are now omnivorous\n  \n  * Herbivores and Omnivores can now eat wheat\n  \n  _____________________________________________________\n  ^cyan;New in version 5.6.191^reset;\n  \n  * Giant Scented Apiary no longer has a drone count limit, and its spawn delay has been reduced from 1.05 to 0.8 to match the Giant Apiary.\n  \n  * Boomerangs can now collect items\n  \n  * New tech: Regen Field\n  \n  * New Tech: Defense Matrix I, II and III. Provides passive defense bonus\n  \n  * Crunchy Chicks can now be ground up into delicious Slew for your carnivorous farm animals. Mmmm!\n    \n  * Precursor Blast Droids now properly apply damage\n  \n  * Precursor Microsphere got some changes:\n  \n    - speed reduced from 12 to 11 to help a bit on corners. \n    - Repulsor Blast reworked. It is far more useful now. Base damage is maxEnergy/3.5. Timer increased to 1.5 seconds.\n    - Increased activation cost from 2 to 30. This applies per repulsor blast as well.\n    - Unlike other spheres, you are able to regain energy.\n    \n  * Precursor chests are more noticable, and the smaller boxy ones got a visual change\n  \n  * Medkit II should no longer cause a crash when used\n  \n  * moved ITD/MTD routing code to the object files.\n  \n  * added item network support to precursor converters.\n  \n  * updated transferUtil's template update block\n  \n  * fixed armor sphere's tooltip to correctly not that [FIRE} activates bombs, not [DOWN]\n  \n  * Sulphuric worlds removed from the Barren pool. This should make barren slightly more common and remove Sulphuric from Tier 1 stars in the bargain.\n  \n  _____________________________________________________\n  ^cyan;New in version 5.6.190^reset;\n  \n  \n  * The information is based on what is CURRENTLY in the tray slots, not what it's growing. So you can pick out the right fertilizer and liquid THEN insert your seed of choice.\n  \n  * Also removed racial descriptions from hydroponics trays as that was hiding useful information from players (ie power draw) using the stock Starbound races.\n  \n  * Modified description on both trays to remove the explicit number of seeds. \n  \n  * Insanity effect corrected\n  \n  * removed Red Desert and Blood Gulch subbiomes from Atropus biomes\n  \n  * Physics Field tech base direction is now 0, meaning you will not move upwards automatically. \n  \n  * fixed a quest loophole for Silicon Knight. It no longer calls for Extractor before being completable\n  \n  * most fertilizers now inform you of what they do for your plants. Secret fertilizers remain unspoiled.\n  \n  * adds super-annoying Meatbag mob to Atropus\n  \n  * adds Algae as a fertilizer for growing trays and hydroponic trays\n  \n  * the legendary weapon Kevin has been rebalanced, and its blasphemous name has been changed\n  \n  * added new Unique weapon tooltips. These should make it quite clear when you have uniques.\n  \n  _____________________________________________________\n  ^cyan;New in version 5.6.1882^reset;\n  \n  * finally corrected the Shadowtop spritesheet/fullbrights\n  \n  * adjusted shadowtop behaviors\n  \n  * Baby animals will now eat from troughs and increase their maturation speed\n    \n  * new weapon type: Striker. Inspired by Flail weapons by ThatThunderCookie. They are mid-damage, mid-range block-breaking flails. Crits can stun, and they possess good knockback.\n  \n  * Hacker set now has Striker set bonus\n  \n  * Intrepid set now has Striker set damage bonus. Crit Chance bonus reduced to 2%\n  \n  _____________________________________________________\n  ^cyan;New in version 5.6.188^reset;\n  \n  * Reverts the 'activate ship' entity message in bootship.lua back to just a message instead of a promise due to issues with mods like Avali when choicing the default ship (will make it so that the SAIL text that appears after bootup won't always appear on BYOS ships again)\n  \n  * adds new sounds to the Warden\n  \n  * adjusts loot in the Cavern dungeon end room and secret room\n  \n  * Robotic pets can now ingest Oil, Lead, Silicon and Carbon and Spare Parts (yes, they'll eat their crap)\n  _____________________________________________________\n  ^cyan;New in version 5.6.187^reset;\n  \n  * fixes baby ironbeaks growing into copperbeaks\n  \n  * copperbeak and ironbeak babies will accept alienmeat rather than cattlefeed thrown on the ground\n  \n  * added missing unlock for Pesticide\n\n  * Warden now properly animates and behaves differently\n  \n  * fixing a strange monument's category. formerly 'pot', now 'decorative' (Kherae)\n  \n  * added a description adjustment for the transferutil variant of the itemscanner. (Kherae)\n  \n  * added new Titan mech Body and Legs (Aimee)\n  \n  _____________________________________________________\n  ^cyan;New in version 5.6.186^reset;\n  \n  * disabled abandoning Vinj's intro quests\n  \n  * corrects Telebrium Dagger arm position\n  \n  * you'll see more Radioactive stars on the starmap\n  \n  * fixes slight graphical twitch to Exitus mech legs\n  \n  * corrected erroneous change to Telebrium Orbs. Should be t2, not t1.\n  \n  * corrected recipe for Vai to use durasteelbar rather than an incorrect ID\n  \n  * rebalanced Exitus mech gun\n  \n  * the Precursor Dungeon now has a SAIL entry once you unlock it within the dungeon itself\n  \n  * Mama Poptop room exit is now a boss door as well, preventing re-entry and cheese tactics.\n  \n  _____________________________________________________\n  ^cyan;New in version 5.6.185^reset;\n  \n  * REVERT - new nodes on Storage Bridges. This may cause issues with your setups. Apologies.\n  \n  * NEW - Storage Bridge 2.0, with the above mentioned nodes present\n  \n  * fixes NPCs calling for 'generatedgun' (a vanilla bug)\n  \n  * fixes NPC death when failing a dialog check (PParrot)\n  \n  * new blade: Vai (Earth)\n  \n  * Rocket Launcher crits reduced\n  \n  * Hazmat suit should properly apply its bonuses\n  \n  * smart box sorting and spouts forgetting their off switches -> fixed\n  \n  * NEW MECH: Exitus (ArCon). Contributed by Pizzacat.\n\n"
    }
  }
]