[
  {
    "DeniedAlternatives": [],
    "Files": {
      "_FUversioning.config": [
        "/text"
      ]
    },
    "Texts": {
      "Eng": "\n\n_____________________________________________________\n  ^cyan;New in version 5.6.221^reset;\n  \n  * Industrial Centrifuges now have 2 input slots\n  * Lab Centrifuges now have 3 input slots\n  * Gas Centrifuges now have 4 input slots\n  * Powder Sifter now has 2 input slots\n  \n_____________________________________________________\n  ^cyan;New in version 5.6.220^reset;\n  \n  * Gishinanki set should have its proper immunities\n  \n  * Matter Blocks, when mined, give placeable blocks rather than a resource. The resource is now acquired via extraction.\n  \n  * Removed most, if not all, of the 'silly' star names. It was fun, but at this point its a tired bit of nonsense. New names replace crazy old ones.\n  \n  * Larva placed in the Incubator will now hatch a maggot\n  \n  * Incubators got a bit of love. Their indicators are more visible, are less janky visually.\n  \n  * Incubators now properly display their filled-with-eggs graphics. Larger stacks increase the visual.\n  \n  * Incubators now play a sound effect when your eggs hatch\n  \n  * Medical Station effects have been moved back to where they were, as I had not intended to move them and they were borking some stuff\n  \n_____________________________________________________  \n  ^cyan;New in version 5.6.219^reset;\n  \n  * fixes some typos (rainy goose)\n  \n  * adds Quantum Ball loot item\n  \n  * Thelusian Longsword should have its proper name (was reading Telebrium Longsword)\n  \n  * Shoats have had their diet swapped to special omnivore, the same as a Pangolin\n  \n  * Added Stun and Bleed immunity to several bosses where it was warranted (Precursor Warbot for example)\n  \n  * Breach Gun alt-fire improved. It uses much less energy and fires much faster. This makes it exceptionally useful in exploration!\n  \n  * Finding a Gorgolith on newly generated Protoworlds should be easier \n  \n  * upgrading the Aetherium Rapier to the Aetherium Puncturer should no longer break the weapon\n  \n  * Ice slipping has been fine tuned, providing more general traction.\n  \n  * removed extra ice-slip files, amalgamated into single script\n  \n  * amalgamated beesting status effects into a single script\n  \n  * cleaned up the stat effect directory.\n  \n  * touched up set bonus code indentation. (Khe)\n  \n  * Fixed some sets which were not quite working right. (Khe)\n\n  * Changed Longinus and Sentry Railgun drones. The now have invul, visible shields but die after around 30 seconds. Damage unchanged. Renamed Decoy Drones. (Khe)\n\n  * Precursor Duplicator now accepts most metals and isotopes\n  \n  * Replaced Worm Mass sprite with an original (Ycar)\n  \n  * Worm Mass renamed to Putrid Worm\n  \n  * Worm Mass attack patters slightly changed\n  \n  * Fleshreaper idle and flight animation speed reduced to slow the tail wiggle\n  \n  * Fleshreaper charge is faster\n  \n  * Fleshreaper ranged gravity attack has a longer telegraph and new projectile\n  \n  * Growing and Hydroponics trays now inform of the base seed cost on the UI itself, as this seems a common question\n  \n  * precursor itemTag touchups (Khe)\n  \n  * added Racial space station desks (zimberzimber)\n  \n  * Space Station desks have fewer rare items\n  \n  * Mech unlock mission has been slightly tweaked and now incorporates Stomping into the tutorial.\n  \n  * Cosmic and Spacetime obelisks are now scan-based rather than smashed\n  \n  * NEW Wraith sprite (Ycar)\n  \n  * Wraith attacks changed\n  \n  * corrected hitech toilet sitting position\n  \n  * added Erchius Buddy backpack (Tori)\n  \n  * added 2 new 2x2 Toolbox storage items\n  \n  * added lesser variant of Ash Storm\n  \n  * added High Gravity Event weather to Mountainous biomes\n  \n_____________________________________________________\n  ^cyan;New in version 5.6.218^reset;\n  \n  * hopefully corrects the small Apiary positioning issue. You will likely need to place them again.\n  \n  * Correction to some Shoggoth sounds referencing invalid sound files\n  \n  * Skittles got some changes (Kherae)\n  \n  * Bone extraction loop has been closed\n  \n  * Meatvine plant recipe should properly craft 3, not 1, seed.\n  \n  * Fleshreapers got heavily changed and are now original content at long last! Their spawn locations have been adjusted as well. (Ycar)\n  \n  * adds Redwood Bark tile, drops from Primeval redwoods (Aelfgifu)\n  \n  * added a ^orange;clear inputs^reset; button to Terminals (Eternalspirit)\n  \n  * Also moved the Refresh button to the bottom right of the Terminal, and added Clear Inputs to bottom middle (Eternalspirit)\n  \n  * replaced 289 counts of pot in item categories with decorative, and one count of science! (Kherae)\n  \n  * Research laptops should now properly flip direction when placed\n  \n  * removed old patchlog entries from this popup \n  \n  * Research voxels properly display in-hand\n  \n_____________________________________________________\n  ^cyan;New in version 5.6.217^reset;\n  \n  * reverted Research costs on Techs. The UI didn't want to actually detect it. Experiment fail. I'll take another stab at it later with updated code.\n  \n  * subs should properly submerge\n"
    }
  }
]