[
  {
    "DeniedAlternatives": [],
    "Files": {
      "_FUversioning.config": [
        "/text"
      ]
    },
    "Texts": {
      "Eng": "\n\n_____________________________________________________\n  ^cyan;New in version 5.6.233^reset;\n  \n  * Mining Laser revamp: Rather than make several versions of mining lasers, upgraded at in a nanofabricator, and then upgraded in a mining bench, all Mining Lasers now stem from the basic model. They no longer upgrade in crucibles, but still upgrade as before within the Mining Bench. \n    * note that the old models remain, for now, but will not for much longer. You will not be able to craft them any longer.\n  \n  * Mining Bench now uses Manipulator Modules once more\n  \n  * damage bonuses on Armor Sets and Battle Packs have been changed to work multiplicatively. Damage bonuses will perform better at higher tiers.\n  \n  * Berserker Unit augment now uses multiplicative damage bonuses\n  \n  * vanilla Damage augments nerfed by 50% to account for the above changes and maintain set balance\n  \n  * fixed a crash bug with Sour Milk and Bees\n  \n  * added a a_modders folder. Within you can find instructions for using some new features in FU in your own stuff. We'll be adding more to this as we go (zimberzimber)\n  \n_____________________________________________________\n  ^cyan;New in version 5.6.232^reset;\n  \n  * new storage tileset for Tiled use (Aelfgifu)\n  \n  * Sentry armor bonus should properly apply\n  \n  * adds Sloped Black Glass tiles (SentientCookie)\n  \n  * corrected Lunari set bonus for Ship Mass. It should apply constantly, not when holding a weapon.\n  \n  * Vai, Lunari Rifle, F4 Rifle, ArCon Longinus,Disc Rifle, Rimecutter, Thorn Rifle, K3 Rifle, Arcon Blaster, 45 Revolver, Breach Gun, Breach Blaster, Breach Pistol,Incinerator, Polaris have had Upgrade graphics added. Some have been tweaked for those upgrades as well. These are not retroactive, and you'll need to upgrade a new one to see the changes.\n  \n  * Hellfire Cannon has a new skin\n  \n  * Precursor Crippler now haz glowz\n  \n  * Aetherium Cleaver is more sanely sized\n  \n  * XT-3 Laser slightly renamed, reskinned and improved\n  \n  * reworked wave gun to be...well, a wave gun\n  \n  * made some changed to the Solus Katana. When dropped as boss loot it is named Solus Sword.\n  * It can now be upgraded into an FU style katana at the nanofabricator. This can in turn be upgraded in a Crucible or via Transmutation Matrixes (Rylasasin)\n  \n  * Intersec armor set Ship Mass bonus applies all the time, not only when weapons are equipped\n  \n  * Cane of Eyes is much quieter\n  \n  * updated some of the metal bar icons\n  \n  * fixed some typos (Locketeerian)\n  \n  * new graphic for Medkit IV (Vincent)\n  \n  * adjusted Elite npc loot to be more rewarding\n  \n  * tweaked the Duplicator script. Fuel used varies in potency of output. Total output is based on the value of the material being duplicated. Higher value = lower output. \n \n  * additional fuel types will work in the Duplicator.\n  \n  * additional duplicatable items added to duplicator (fertilizers, biofuels, particles)\n  \n  * you'll probably want to break and re-place the Duplicator to be certain its values are correct (unless you dont want yours to work!)\n  \n  * wire relays are now called power relays. their text has been updated to indicate their power switch by direction rather than number. They also more reliably shut off power to downstream objects when turned off. (Kherae)\n  \n  * powered objects should no longer be inactive on loading a game (kherae)\n  \n  * converted jumpboost, augment and artifact status effects to new system. also converted gasfx (kherae)\n  \n  * removed unused bounds variable definitions from a few locations (kherae)\n  \n  * added a generic status applier, which can apply effects at init, during update, or at uninit (kherae)\n  \n  * adjusted the vortex cape to use an effect using the above, resulting in the beamin effect being played when the cape is removed. Increases coolness. (kherae)\n  \n  * fixed a small bug with update blocks in the generic scripts (kherae)\n  \n  * the Pixel Printer and the Pixel Compressor are now craftable at tier 3 (titanium) in the Architects Table, rather than tier 4 (durasteel). \n  \n  * harvest turrets now attack plants at all of their occupied spaces, rather than just at their root position (kherae)\n  \n  * Added 'fu_' prefix all questlines and sublines in the quest list GUI (zimberzimber)\n  \n  * This was done to prevent conflicts with possible future non-FU content that would use the GUI (zimberzimber)\n  \n  * Players with already complete questlines will get the completion reward again (only once) due to this change  (zimberzimber)\n  \n_____________________________________________________\n  ^cyan;New in version 5.6.231^reset;\n  \n  * new Novakid ship parts (Siv)\n  \n  * Precursor Duplicator renamed to Duplicator\n  \n  * new look for Duplicator (Ycar)\n  \n  * adjusted Duplicator UI to be more clear\n  \n  * added Research Server (TimothyWiggins)\n  \n  * Ship Crafting Table has a new look! (TimothyWiggins)\n  \n  * NEW machine: Manufacturing Station (Xilosc) : for 40W of power you can mass-produce goods! Toss in the item to create in the top left slot. Toss the ingredients it requires in the core slots....and then let it work its magic!\n  \n  * quarry fixed (Kherae)\n  \n  * genericStatApplier script now can be appended to status effects to maintain any original effects. (Kherae) \n  \n  * fixed a bug where non-existent troughs sought by farm animals would lead to their imminent demise. (cat2002)\n  \n_____________________________________________________\n  ^cyan;New in version 5.6.230^reset;\n\n  * Lastree mech part compatibility added\n  \n  * corrupt/toxic micro-flies no longer have hunting loot\n  \n  * added mech arms: Flame Arm, II and III, Ice Arm I, II and II,  Saw Launcher and Shard Blaster\n  \n  * Moved the Graviton Gun, Grav Cannon, Hyperion and Particle Cannon to the Rockets tab of the armory.\n  \n  * Survival difficulty should no longer drop Consumables on death\n  \n  * Adds treehouse5 microdungeon (Skies912)\n  \n  * Moves treehouses to their own dungeon file (aelfgifu)\n  \n  * Adds slight chance of treehouses to bog biome, with greatest chance still in primeval biomes (aelfgifu)\n  \n  * Old Timber now extracts into Methanol and Fungal Ichor. (aelfgifu)\n  \n  * elementblocks now display percentage. also, converted to new system (kherae)\n  \n  * lights now use a single script instead of a bunch of identical ones. (kherae)\n  \n  * shadowblock 1 through 3 actually use the value from the statuseffects, instead of just 25 (kherae)\n  \n  * pumps scan and pump properly, instead of being offset when attached from one direction. (kherae)\n  \n  * moved a function to excavatorCommon and had the script require vec2. (kherae)\n  \n  * changed some monster shortdescriptions so that people don't end up with lowercase named pets. And burrowers to more generic short strings because reasons. (kherae)\n\n  * Precursor Microchip renamed to Neural Processor\n  \n  * Precursor Fuel Cell renamed to Dimensional Cell\n  \n  * Precursor Core renamed to Flux Core\n  \n  * Precursor Quantum Fluid is now simply Quantum Fluid\n  \n  * Tech crafting now uses Research Storage\n  \n  * Added Severed Hand in a Bag\n  \n  * The rest of the body is located in your Dads shed in the back yard, should the cops come looking.\n  \n  * Research Storage renamed to Research Holodisc\n  \n  * Added a 500 Research item : Research Microdisc\n  \n  * added a 5000 Research item:  Research Megadisc\n  \n  * Exitus mech parts can now have the light-grey area dyed\n  \n  * Grabbers no longer operate within the radius of another grabber. This is a safety measure for irresponsible use of grabbers causing endless loops (kherae)\n  \n  * added two more mysterious balls. (kherae)\n  \n  * The Greg in Skittles had a few accidents related to Kevin and Esther, and now refuses to work in the outpost or the science outpost. (kherae)\n  \n  * Added a new code 'library' to draw from with regard to status related effects. will continue improving on it. currently includes functions to make entities say things, and area-application of status effects. similar functions from the script libraries to be moved later. (kherae)\n\n  * increased Striker projectile speed\n  \n  * reduced Striker Crit Damage bonus\n  \n  * reduced Striker energy cost\n  \n  * minor improvement to sifter UI\n  \n  * Wooden Sifter has one input slot as intended\n  \n_____________________________________________________\n  ^cyan;New in version 5.6.222^reset;\n  \n  * started replacing Atropus surface parallax\n  \n  * added Vina plush toy (Moonlit Comet) as a reward for completing the Booze quests\n  \n  * animated bee frames altered for all apiaries. This should correct the 1-tile-reposition that seems to happen when you walk off-screen.\n  \n  * Xithricite Wand projectile frames file corrected\n  \n  * Rapiers should properly upgrade to tier 8 at crucibles. They no longer get increased fireTime. See next point.\n  \n  * Rapiers now get an additional 0.10% per tier to Crit chance.\n  \n  * Rapiers get an additional +0.5 bonus damage to crits per tier \n  \n  * All upgraded weapons have reduced crit chance bonus. It was 0.5% per tier. This value has been reduced to 0.25 per tier\n  \n  * Precursor loot lists have a chance to drop most of their deco. *most*, not all.\n  \n  * new racial ship Thrusters (Yanazake)\n  \n  * Minor adjustments to Shoggoth boss room to minimize its tendency to get stuck\n  \n  * Shoggoth Aggro sounds changed\n  \n  * Slime Broadsword should properly appear in crafting stations\n  \n  * replaced some dungeon music\n  \n  * slightly improved the Plebian armor set energy bonus, damage bonus and protection bonus\n  \n  * Volcanic Ash should now Sift\n  \n  * fixed space station selling prices being too high (zimberzimber)\n  \n  * corrected patch for modded race access to BYOS (universe_server.config.patch)  (Hubnester)\n  \n  * Neishin armor bonus should properly function\n  \n  * moved garuda missile launcher files to a more appropriate location.  (Khe)\n  \n  * made Crystal Skull save its death location info to the player, rather than to the world.  (Khe)\n  \n  * added deployment hacky script. can now send entity messages to the player to get player.worldId.  (Khe)\n  \n  * completely revamped immunityeffect application (Khe)\n  \n  * obelisks now spawn inactive decorative versions when scanned  (Khe)\n  \n  * New microdungeons - scientific greenhouse in a tree, 3 new treehouse,  1 spooky treehouse! (Aelfgifu)\n  \n  * changed 0.0 priority of overground chests in primeval biomes to 1 (Aelfgifu)\n  \n  * removed precursor-styled obelisk from aether dungeon (Aelfgifu)\n  \n  * coding for Old Timber, including recipe and unlock (Aelfgifu)\n  \n  * new tileset of all FU doors  (Aelfgifu)\n  \n  * partytime3 uses tables instead of entitytype as a comparison. (Khe)\n  \n  * Loot boxes in the cursor are now consumed first (zimberzimber)\n_____________________________________________________\n  ^cyan;New in version 5.6.221^reset;\n  \n  * Precursor Databox is no longer printable\n  \n  * Radburn has its own icon\n  \n  * Industrial Centrifuges now have 2 input slots\n  \n  * Lab Centrifuges now have 3 input slots\n  \n  * Gas Centrifuges now have 4 input slots\n  \n  * Powder Sifter now has 2 input slots\n  \n  * Adds a pet renamer that allows you to rename captured pets (Hubnester)\n  \n  * Makes it so that the music player says what music it is currently playing when turned on (won't display it if you selected it before the update) (Hubnester)\n  \n  * Adds something to universe_server.config to make it easier to add support for FU BYOS in race mods (Hubnester)\n  \n  * Allows mods to add items to give the player when they select the BYOS ship (Hubnester)  \n  \n  * Some tiny adjusts to the pickup and pushback augments to hopefully reduce the chance of them bricking the characters of less intelligent players still irresponsibly using combinable augments. (Kherae)\n  \n  * a certain mysterious ball is no longer quite as safe for those who aren't filthy casuals. (Kherae)\n  \n  * Added some handling for energyrestorepercentage.lua to be told not to use visuals to both that and healthrestorepercentage. Also added a config option to change the effects to a flat percent per second effect. (Kherae)\n  \n  * Added a collection of food to health conversion status effects, at varying levels of safety. currently only 100 percent heals, at 1 to 1 and 1 to 10 food to health percent ratios. (Kherae)\n\n_____________________________________________________\n  ^cyan;New in version 5.6.220^reset;\n  \n  * Gishinanki set should have its proper immunities\n  \n  * Matter Blocks, when mined, give placeable blocks rather than a resource. The resource is now acquired via extraction.\n  \n  * Removed most, if not all, of the 'silly' star names. It was fun, but at this point its a tired bit of nonsense. New names replace crazy old ones.\n  \n  * Larva placed in the Incubator will now hatch a maggot\n  \n  * Incubators got a bit of love. Their indicators are more visible, are less janky visually.\n  \n  * Incubators now properly display their filled-with-eggs graphics. Larger stacks increase the visual.\n  \n  * Incubators now play a sound effect when your eggs hatch\n  \n  * Medical Station effects have been moved back to where they were, as I had not intended to move them and they were borking some stuff\n  \n_____________________________________________________  \n  ^cyan;New in version 5.6.219^reset;\n  \n  * fixes some typos (rainy goose)\n  \n  * adds Quantum Ball loot item\n  \n  * Thelusian Longsword should have its proper name (was reading Telebrium Longsword)\n  \n  * Shoats have had their diet swapped to special omnivore, the same as a Pangolin\n  \n  * Added Stun and Bleed immunity to several bosses where it was warranted (Precursor Warbot for example)\n  \n  * Breach Gun alt-fire improved. It uses much less energy and fires much faster. This makes it exceptionally useful in exploration!\n  \n  * Finding a Gorgolith on newly generated Protoworlds should be easier \n  \n  * upgrading the Aetherium Rapier to the Aetherium Puncturer should no longer break the weapon\n  \n  * Ice slipping has been fine tuned, providing more general traction.\n  \n  * removed extra ice-slip files, amalgamated into single script\n  \n  * amalgamated beesting status effects into a single script\n  \n  * cleaned up the stat effect directory.\n  \n  * touched up set bonus code indentation. (Khe)\n  \n  * Fixed some sets which were not quite working right. (Khe)\n\n  * Changed Longinus and Sentry Railgun drones. The now have invul, visible shields but die after around 30 seconds. Damage unchanged. Renamed Decoy Drones. (Khe)\n\n  * Precursor Duplicator now accepts most metals and isotopes\n  \n  * Replaced Worm Mass sprite with an original (Ycar)\n  \n  * Worm Mass renamed to Putrid Worm\n  \n  * Worm Mass attack patters slightly changed\n  \n  * Fleshreaper idle and flight animation speed reduced to slow the tail wiggle\n  \n  * Fleshreaper charge is faster\n  \n  * Fleshreaper ranged gravity attack has a longer telegraph and new projectile\n  \n  * Growing and Hydroponics trays now inform of the base seed cost on the UI itself, as this seems a common question\n  \n  * precursor itemTag touchups (Khe)\n  \n  * added Racial space station desks (zimberzimber)\n  \n  * Space Station desks have fewer rare items\n  \n  * Mech unlock mission has been slightly tweaked and now incorporates Stomping into the tutorial.\n  \n  * Cosmic and Spacetime obelisks are now scan-based rather than smashed\n  \n  * NEW Wraith sprite (Ycar)\n  \n  * Wraith attacks changed\n  \n  * corrected hitech toilet sitting position\n  \n  * added Erchius Buddy backpack (Tori)\n  \n  * added 2 new 2x2 Toolbox storage items\n  \n  * added lesser variant of Ash Storm\n  \n  * added High Gravity Event weather to Mountainous biomes\n  \n_____________________________________________________\n  ^cyan;New in version 5.6.218^reset;\n  \n  * hopefully corrects the small Apiary positioning issue. You will likely need to place them again.\n  \n  * Correction to some Shoggoth sounds referencing invalid sound files\n  \n  * Skittles got some changes (Kherae)\n  \n  * Bone extraction loop has been closed\n  \n  * Meatvine plant recipe should properly craft 3, not 1, seed.\n  \n  * Fleshreapers got heavily changed and are now original content at long last! Their spawn locations have been adjusted as well. (Ycar)\n  \n  * adds Redwood Bark tile, drops from Primeval redwoods (Aelfgifu)\n  \n  * added a ^orange;clear inputs^reset; button to Terminals (Eternalspirit)\n  \n  * Also moved the Refresh button to the bottom right of the Terminal, and added Clear Inputs to bottom middle (Eternalspirit)\n  \n  * replaced 289 counts of pot in item categories with decorative, and one count of science! (Kherae)\n  \n  * Research laptops should now properly flip direction when placed\n  \n  * removed old patchlog entries from this popup \n  \n  * Research voxels properly display in-hand\n  \n_____________________________________________________\n  ^cyan;New in version 5.6.217^reset;\n  \n  * reverted Research costs on Techs. The UI didn't want to actually detect it. Experiment fail. I'll take another stab at it later with updated code.\n  \n  * subs should properly submerge\n"
    }
  }
]