[
  {
    "DeniedAlternatives": [],
    "Files": {
      "_FUversioning.config": [
        "/text"
      ]
    },
    "Texts": {
      "Eng": "\n_____________________________________________________\n  ^cyan;New in version 5.6.216^reset;\n\n  * added 'reagent' tag to bees (drone and queen of all types)\n  \n  * Starmint description corrected (XDGrangerDX)\n  \n  * Skittles has been tweaked (Kherae)\n  \n  * fixed some grammar/typos\n  \n  * telebrium boomerang status effect corrected\n  \n  * Gorgoliths should be easier to find\n  \n  * Precursor Databox adjusted. It is no longer a container in the traditional sense and now generates research\n  \n  * ^red;FU techs have added Research costs when crafting^reset; per tier: (200/350/500/750/1100/2200/3500/5000)\n    \n  * all red sand variants should properly sift \n  \n  * ^yellow;New!^reset; - Personal Computer and Advanced Computer objects. These generate research slowly.\n    \n  * ^yellow;New!^reset; - animated Talking glitch for stations/quests (Ycar)\n  \n  * ^yellow;New!^reset; -  Precursor themed ship parts. Drops in precursor loot pools\n  \n  * ^yellow;New!^reset; -  Fuel Tank for BYOS (TotalBlazing)\n  \n  * ^yellow;New!^reset; -  ship antennae deco (TotalBlazing)\n  \n  * 'Silicon Knight' quest now requires 1, not 10 , silicon as its text implies.\n  \n  * ^yellow;New!^reset; -  Slime race NPCs (thx to Xel and hieru_chan) \n  \n  * ^yellow;New!^reset; -  farmable Shoats to Gelatinous biomes (from slime race mod) (thx to Xel and hieru_chan)\n  \n  * ^yellow;New!^reset; -  slime race weapons/gear with FU adjustments (thx to Xel and hieru_chan)\n  \n  * ^yellow;New!^reset; - animation states to Kevin and Vinj speech graphics for radiomessages as well as additional characters (Ycar)\n\n  * ^green;Update byos to support variations of default ships^reset; : ^orange;This way other mods can modify what the default ships capabilities are^reset; without having to modify or extend the fu_byosai.lua script. (ColonolNutty)\n  \n  * Swarm Guns have been -heavily- rebalanced. They are no longer the most powerful weapons in the game.\n  \n  * You can now create ^green;'research voxels'^reset; at the ^orange;Matter Assembler^reset;\n  \n  * Goods in the Science Outpost radien shops are cheaper\n  \n  * submarines will no longer function properly in liquids that are not like water\n  \n\n_____________________________________________________\n  ^cyan;New in version 5.6.214^reset;\n\n  * The poptop cavern gate can now detect your tricorder if it's in an essential item slot\n  \n  * corrected an erroneous line in the Transmutation Matrix preventing it from upgrading gear. it should properly function now!\n  \n_____________________________________________________\n  ^cyan;New in version 5.6.210^reset;\n  \n  * Bounty Hunter set bonus should properly apply\n  \n  * Bounty Hunter set should now be dyeable\n  \n  * corrects Transmutation Matrix upgrade failing to find itself to allow upgrading\n  \n_____________________________________________________\n  ^cyan;New in version 5.6.209^reset;\n  \n  * Moved the tricorder check to the poptop cavern gate from the ancient console and improved it's code a bit (Hubnester)\n  \n  * Made the quest to get the tricorder basically complete it for anyone within a 500 block radius of someone who completes it (Hubnester)\n  \n  * Changed the starbooze npc to use a new behaviour instead of modifying a vanilla one for it (Hubnester)\n  \n  * added Adv.Alloy, Zerchesium, Xithricite, Hellfire rapiers (Ycar)\n  \n  * added some new Crew Bed types\n  \n  * Gives more races racialiser support (Hubnester)\n  \n  * added some new sounds to Tricorder modes. Each has a distinct tone\n  \n  * Trianglium katana added\n  \n  * Apiary positioning corrected \n\n  * Improves the BYOS ship slightly (hubnester)\n  \n  * Updates the music player music list (hubnester)\n  \n  * Adds racialiser support to more races (hubnester)\n  \n  * Removes some redundancies from universe_server.config.patch (hubnester)\n  \n  * NOTE: THIS UPDATE WILL CAUSE ISSUES IF YOU HAVE SOMETHING THAT MAKES THE COSMIC CRUCIBLE OBTAINABLE (hubnester)\n\n_____________________________________________________\n  ^cyan;New in version 5.6.208^reset;\n\n* NEW : Scan to Interact mechanic. Will be implemented soon. (zimberzimber)\n  \n* similar to quarries, higher level pumps now work faster (Khe)\n\n* Fixed a bug causing pumps to cease working (Khe)\n\n* fixed a small item instancing error caused by trying to drop fractional items (Khe)\n\n* fixed a bug in lootbox script\n\n* Fixed being able to get free upgrades with upgrade kit by opening the pane and dropping the upgrade kit. (zimberzimber)\n\n* Item list now displays real item name for RNG weapons (zimberzimber)\n\n* new Aether microdungeons (Aelfgifu)\n\n* wire relay now states that its first input controls its active state. no functional change. (Khe)\n_____________________________________________________\n  ^cyan;New in version 5.6.207^reset;\n  \n  * some small behavioral adjustments made to War-Born\n  \n  * updated Erchibud visuals to include a more thematic eye\n  \n  * adjusted quest-group rewards in the Tricorder\n  \n  * Transmutation Matrix added\n  \n  * new look for Apiaries and Giant Apiaries\n  \n  * Quarries are now tiered (copper / iron / titanium / densinium)\n\n  * Pumps are now tiered (copper / iron / titanium / densinium)\n\n  * better math for Pong (cat2002)\n  \n  * new alt for Xithricite Bow\n  \n  * Primus armor bonuses corrected and adjusted\n  \n  * Bug House appears in proper tab in the foraging station\n  \n  * the Mech unlock quest is now available immediately upon entering the Outpost\n  \n  * Plasma Gun alt fire improved\n  \n  * Panishment tweaked and added to loot pools\n  \n  * Remote Grenade launcher should no longer appear as a PGI\n  \n  * fixed categories on the new precursor pistols. they should sort properly, but retain their category label.\n  \n  * ITDs will no longer accept zero as a valid input.\n  \n _____________________________________________________\n  ^cyan;New in version 5.6.206^reset;\n  \n  * Adds precursor stair tile \n  \n  * Adds precursor databox and assocaited microdungeon (Aelfgifu)\n  \n  * corrects some issues with hair styles in the wrong colors\n  \n  * adds Panishment (Khe)\n  \n  * corrects some Precursor weapons missing Precursor tag for set bonuses (Khe)\n  \n  * corrects some miscategorized pipes (Khe)\n  \n  * Bunnything shouldn't crash the Creatures collection\n  \n  * bot spawner objects now create pods that work right. (Khe)\n  \n  * Snub Gun improved: \n    - baseDps increased (8.5 -> 9.5) (1.7 -> 1.9 per shot)\n    - shot speed increased (55 -> 60)\n    - burstTime increased by +0.05 (0.035 to 0.04)\n  \n  * Nomad armor set improved. It now provides +15% rather than +10% to damage with Daggers. It now also applies to Short Spears. It's tooltip is less verbose, too.\n  * robots and lithovores can now enjoy Rust Chowder and Oil Stew\n  \n  * Lunari Katana now has the Lunari tag for set bonuses\n  \n  * Lunari Scythe now has the Lunari tag for set bonuses\n  \n  * added 4 Thelusian melee weapons\n  \n  * Precursor Quantum Fluid has less overall value when using converters, and will be a bit less simple to produce.\n  \n  * Faulty converters create vastly less Crunchy Chicks\n  \n  * Remote Grenade Launcher should now show its stats\n"
    }
  }
]