[
  {
    "DeniedAlternatives": [],
    "Files": {
      "_FUversioning.config": [
        "/text"
      ]
    },
    "Texts": {
      "Eng": "\n\n _____________________________________________________\n  ^cyan;New in version 5.6.207^reset;\n  \n  * some small behavioral adjustments made to War-Born\n  \n  * updated Erchibud visuals to include a more thematic eye\n  \n  * adjusted quest-group rewards in the Tricorder\n  \n  * Transmutation Matrix added\n  \n  * new look for Apiaries and Giant Apiaries\n  \n  * Quarries are now tiered (copper / iron / titanium / densinium)\n\n  * Pumps are now tiered (copper / iron / titanium / densinium)\n\n  * better math for Pong (cat2002)\n  \n  * new alt for Xithricite Bow\n  \n  * Primus armor bonuses corrected and adjusted\n  \n  * Bug House appears in proper tab in the foraging station\n  \n  * the Mech unlock quest is now available immediately upon entering the Outpost\n  \n  * Plasma Gun alt fire improved\n  \n  * Panishment tweaked and added to loot pools\n  \n  * Remote Grenade launcher should no longer appear as a PGI\n  \n  * fixed categories on the new precursor pistols. they should sort properly, but retain their category label.\n  \n  * ITDs will no longer accept zero as a valid input.\n  \n _____________________________________________________\n  ^cyan;New in version 5.6.206^reset;\n  \n  * Adds precursor stair tile \n  \n  * Adds precursor databox and assocaited microdungeon (Aelfgifu)\n  \n  * corrects some issues with hair styles in the wrong colors\n  \n  * adds Panishment (Khe)\n  \n  * corrects some Precursor weapons missing Precursor tag for set bonuses (Khe)\n  \n  * corrects some miscategorized pipes (Khe)\n  \n  * Bunnything shouldn't crash the Creatures collection\n  \n  * bot spawner objects now create pods that work right. (Khe)\n  \n  * Snub Gun improved: \n    - baseDps increased (8.5 -> 9.5) (1.7 -> 1.9 per shot)\n    - shot speed increased (55 -> 60)\n    - burstTime increased by +0.05 (0.035 to 0.04)\n  \n  * Nomad armor set improved. It now provides +15% rather than +10% to damage with Daggers. It now also applies to Short Spears. It's tooltip is less verbose, too.\n  * robots and lithovores can now enjoy Rust Chowder and Oil Stew\n  \n  * Lunari Katana now has the Lunari tag for set bonuses\n  \n  * Lunari Scythe now has the Lunari tag for set bonuses\n  \n  * added 4 Thelusian melee weapons\n  \n  * Precursor Quantum Fluid has less overall value when using converters, and will be a bit less simple to produce.\n  \n  * Faulty converters create vastly less Crunchy Chicks\n  \n  * Remote Grenade Launcher should now show its stats\n  \n  \n _____________________________________________________\n  ^cyan;New in version 5.6.205^reset;\n  \n  * adjustments to the poptop dungeon\n  \n  * bot spawners turn into a filled pod on interact, instead of the bot. image repair tool got a nicer name. (Kherae)\n  \n  * corrected some minor lighting issues on edelwood eyes\n  \n  * coffee beans should stack\n  \n  * Collection unlock for Steampunk Chest corrected\n  \n  * Solar Power change: Your free ride is over. Solar panels no longer react well with artifical light at all. They will function *only* during the daytime now, leaving your batteries to do what they were designed for during the evening. \n \n  * Reworded the description to include the range of the grabber v1, 2 & 3. (Katorone)\n  \n  * Text clarity on bee quests 11 and 13(Katorone)\n  \n _____________________________________________________\n  ^cyan;New in version 5.6.204^reset;\n  \n  * Alternate carnivore slew recipes. Can make slew out of Poultry, Tentacles, or Ribs. All 3 now extract to slew instead of science. (rylasasin)\n  \n  * Slime Launcher alt-fire should have distance\n  \n  * Swarmgun upgrade should appear properly in the nanofab\n  \n  * Aether boomerang corrected\n  \n  * Attempted a fix for Brewmaster tenant dying rather than being useful\n  \n  * Most boomerangs now have Piercing disabled, save for a few special types\n  \n  Shortspear Improvements:\n    * damageArea for shortspears increased\n    * shortspear base damage slightly increased\n    * shortspear damage increased per-step\n    * shortspear cooldown duration slightly reduced\n  \n  Rapier Improvements:\n    * Rapier base damage slightly increased\n    * Rapier per-step damage adjusted to increase with each strike\n  \n  Striker Improvements:\n    * Striker hit area improved. It should now hit an area the size of the actual ball.\n    * Striker base damage slightly increased\n    * Striker energy use decreased\n    * Strikers should no longer randomly freeze up\n  \n _____________________________________________________\n  ^cyan;New in version 5.6.203^reset;\n  \n  * added  Ancient Broadsword, Ancient Rapier, Ancient Spear, Ancient Striker, Iron Scythe, Iron Quarterstaff, Tungsten Quarterstaff, Tungsten Rapier, Pyreite Rapier (Kreon the Insane)\n  \n  * added Predator Scythe (toss me your name...i lost who contributed this one!)\n  \n  * added Iron Boomerang, Tungsten Boomerang, Titanium Boomerang, Telebrium Boomerang, Durasteel Boomerang, Burrower Boomerang, Xithricite Boomerang, Precursor Boomerang, Aetherium Boomerang and Aetherium Boomerang upgrade (Rylasasin)\n  \n  * added Elder Grenade Launcher (MinHui)\n  \n  * Ice augment now provides slush, ice and snow immunities (Kherae)\n  \n  * Cattle Feed can now be unlocked and crafted without a hand mill (Aelfgifu)\n  \n _____________________________________________________\n  ^cyan;New in version 5.6.202^reset;\n  \n  * Mulch, Fertilizer, Ichor, Organic Soup and Elder Fluid now all provide a bonus of -1 to seed cost on Growing and Hydro trays.\n  \n  * new ...merchant(?) added to Science Outpost (moonlit comet)\n  \n  * Perfect furniture recipes corrected to use Dense Alloy in place of Durasteel\n  \n  * Changes the FU start mission a bit so that it no longer has declinable popups of any sort. This should solve the issue with accidental declines. The caveat is you'll need to actually read.\n\n  * Pointer after completing Vinj's quests should properly update\n  \n  * Azun Robes are now dyeable (Ulysses)\n  \n  * adds new Erchibud farm beast (Art by Kurloz, code by Aelfgifu)\n    - Drops eggs from Erchius Horror.\n    - Also available for purchase at terramart. \n    - Has a special diet of moon-centric goods. \n  \n  * extra stat window (crit, shield bonuses etc) improvements. Should more accurately display crits\n  \n  * No more 'Uninit found 0 untiered' lootboxes. prints, and removed a copy of the previously commented script for converting trade goods into their currency variants (zimberzimber)\n _____________________________________________________\n  ^cyan;New in version 5.6.201^reset;\n  \n  * You can now dye Monks Robe armor set\n  \n  * You can now dye Hoplite armor set\n  \n  * You can now dye Operative armor set\n  \n  * You can now dye Leather armor\n  \n  * You can now dye the Vagabond set\n  \n  * You can now dye the Hazard set\n  \n  * You can now dye the Lunari set\n  \n  * You can now dye Bone Steel set\n  \n  * replaced default Thelusian ship with a modified version (Stinger Ship. Thanks to SubmarineKnight for the ship!)\n  \n  * Immunity Field should no longer cause a crash\n _____________________________________________________\n  ^cyan;New in version 5.6.200^reset;\n  \n  * Increased starting size of BYOS ships\n  \n  * Fixes screwy colors on Radien. (Moonlit Comet)\n  \n  * the Protectorate mission should no longer start covered by the update window (zimberzimber)\n\n  * cold immunity and heat immunity augments (not the extreme ones): updated tooltips to match actual effects as defined in their lua files. (Kherae)\n  \n  * total immunity 2: inserted nitrogen immunity in place of vanilla 'liquidimmunity' (Kherae)\n  \n  * poison shield and poison barrier augments: shield now protects from proto poison. Barrier from proto poison and bio ooze. Both had their tooltips updated to reflect that they increase poison resistance by 25%, as inherited from the vanilla effect. (Kherae)\n\n  * Visual update to Eldar Altar UI\n\n  * Revamped all Thelusian visuals from an entirely new concept.\n  \n  * Added new shop to the Science Outpost (Moonlit Comet)\n\n  * Ship fuel cost for travel has been adjusted by +2 (Hubnester)\n  \n  * Chicken Feeder will no longer allow its contents to spoil\n\n"
    }
  }
]