[
  {
    "DeniedAlternatives": [],
    "Files": {
      "_FUversioning.config": [
        "/text"
      ]
    },
    "Texts": {
      "Eng": "\n\n_____________________________________________________\n  ^cyan;New in version 5.6.247^reset;\n  \n  * fixed a couple oopsies: shadow race now has a mech, treehouse dungeon should no longer be mislabelled\n  \n  * added shadow-themed ship objects\n_____________________________________________________\n  ^cyan;New in version 5.6.247^reset;\n  \n  * Shadows [Tenebris] are now a playable race \n  \n  * Kirhos and Thelus beamup colors (tiramisuapimancer)\n  \n  * added moar loar\n  \n  * ran all images through PNGGauntlet. Reduced mod size by 10mb\n  \n  * Eden biomes no longer spawn below tier 3, and their maximum tier has increased to 6\n  \n  * You can now trade Artifacts for resources at the Radien shop at the Science Outpost\n  \n  * adjusted numerous resource sprites\n  \n  * added support for the Elithian Races Aegi mech \n  \n  * Changes treehouse5 from a microdungeon to a regular dungeon, giving it a better chance to spawn. (Aelfgifu)\n  \n  * Adds a barn and hidden room to the treehouse (Skies912)  \n  \n  -------------------------\n  ^orange;Bug Fixes^reset;\n  -------------------------\n  * amber light no longer offset 6 tiles. (kherae)\n  \n  * several elder-themed objects are no longer printable\n  \n  * precursor vertical single-tile doors should now be printable\n  \n  * Bee Wings were missing an unlock. Now unlocked via Exceptional combs\n  \n  * Queen Stinger was missing an unlock. Now unlocked via Jungle combs\n  \n  * Mini-shoggoths will no longer drop Shoggoth Flesh, completing the Shoggoth mission. They drop something else instead. It has a use. You'll need to learn it yourself.\n  \n  * Elder Altar now properly plays sound when active\n  \n  * uranium hammer description no longer references lead, which was not in its recipe (Aelfgifu)\n  \n  * can no longer stand on My Little Cthulhu (Aelfgifu)\n  \n  * Brass Dye should be properly craftable \n  \n  * Radioactive Barrier augment properly applies 25% resistance (was 10%)\n  \n  * Queen Shield stats adjusted to be better than the lesser Amber shield\n  \n  * Magma Frames correctly set a hive to always be Day, rather than Night. Their description also no longer erroneously claims they increase production.\n  \n  * Zenith Pistol should be properly upgradeable in a Crucible\n  \n  \n_____________________________________________________\n  ^cyan;New in version 5.6.246^reset;\n  \n  * Hazard suit oxygen supply drastically increased (from +900s oxygen, to +1500% oxygen). Yes, this means you can increase breath by other means and have a x1500% modifier to that total.\n  \n  * adds sloped tinted glass tiles (6798) and sloped tinted glow-glass (6799)  (SentientCookie)\n  \n  * adds brass dye (TimothyWiggins)\n  \n  * adds Spacepunk armor (TimothyWiggins)\n  \n  * weapons that have Stun Chance now display this in their tooltips\n  \n  * corrects zerchesium greataxe description\n  \n  * revised some sections of the Dark Caverns \n  \n  * Aetherium Defender 'throw time' reduced from 6 , to 2 seconds.\n  \n  * More adjustments to Atropus parallax\n  \n  * Harvest turrets now use one code file for farmbeast/bug/plant turrets. (kherae)\n  \n  * plant/farmbeast turret descriptions adjusted. (kherae)\n\n  * all Daggers are now aimable (SentientCookie)\n  \n  * corrected defenseboost effects granting incorrect resistance debuffs (kherae)\n  \n  * Adds 6 new haunted treehouses in corrupted forest, deadwood, gore forest, haunted forest, and haunted graveyard biomes. (Aelfgifu)\n  \n  * Also: new npc type, body object that does not auto refill, lights tileset, storage tileset, and dead bodies and wood shed treasure pools. (Aelfgifu)\n  \n  * 1 new treehouse for primeval planets (by Skies912)\n  \n  * all shields should now be aimable. (SentientCookie)\n  \n  * incorporated Sentient Suppers 'better NPC aiming' into behaviors. You should be able to have it installed along with FU without consequence. (SentientSupper)\n  \n  * stamped out the last inconsistencies between the vanilla intro texts and the new ones. No more mention of a graduation ceremony anywhere. (Rylasasin)\n  \n  * removed unused changes to the vanilla sphere quest, since they are no longer needed with the mission being disabled in FU. This should correct issues with that quest appearing from other mods and being impossible to complete.\n  \n_____________________________________________________\n  ^cyan;New in version 5.6.245^reset;\n  \n  * Proto Rifle added (Valo). Original sprite slightly altered to match scheme for proto-tier weapons and gear.\n  \n  * Phaser should now properly unlock from Armory access (tier2+)\n  \n  * Added Irradium scythe, shortspear, longsword, greataxe, quarterstaff (Uxie)\n  \n  * Tooltip for Growing Trays and Hydroponics Trays now explicitly states that it requires 3 seeds as a base, and informs that the item can be scanned for details.\n  \n  * corrected a light/sun issue with solar panels and cleaned up code (cat2002)\n  \n  * Intro quest text changed. It is no longer a graduation ceremony and instead gains more weight and urgency.\n  \n  * Dark Caverns ball hallway text adjusted to mention explosives since people apparently lack the foresight to realize the other bomb door is identical and works the same way despite being told -and- it looking the same with a rather obvious missile on it. Seriously people, learn to Video Game.\n  \n  * corrected Aetherium Fist recipe\n  \n  * removes all SAIL patches from FU , as they are now located on the Workshop, Git and the CF Forums. Check the FU page for a link. You will need this is you use any custom races or SAIL mods, or the FU SAIL will not activate properly.  (xn-5o8h)\n  \n  * Erchius Buddy was too good for what it does. It now conveys a defense penalty of 10%, and requires erchius crystals in its recipe.\n  \n  * added Iron LMG (Valo)\n  \n  * Bee candles are now wired (Alepod)\n  \n  * Tier 1 NPCs have slightly decreased protection (from 12 --> 10 for tier 1)\n  \n  * adjusted tier 1,2 and 3 monster power multipliers (+0.05 to 1 and 2)\n  \n_____________________________________________________\n  ^cyan;New in version 5.6.244^reset;\n\n  * Metal Combs provide 50% less resources when extracted, to encourage centrifuging instead\n  \n  * fixed wasteland dungeons trying to spawn invalid NPC seed\n  \n  * Farm animals now have an extra display graphic for hunger. Gold Heart implies 'very happy' and capable of mating.\n  \n  * Animals can now mate more often, starting at 90% happiness rather than 100%. 100% happiness animals can produce up to 2 eggs.\n  \n  * Animals below 100% happiness that mate consume food and can produce a maximum of 1 egg\n  \n  * added Beast Harvesting Turret. It does what you assume. (Kherae)\n  \n  * you can now craft the Mech Assembly Station, since so many people ask for it (for looks rather than utilty). You'll find it in a tier2 or higher Auto-Assembler/Matter Assembler\n  \n  * added Elder Shotgun (ashey)\n  \n  * adds techstation updates to most custom races that remain, including ones rarely used. Apart from load-order related issues, FU SAIL should now work with pretty much everything. (xn-5o8h)\n  \n  * Las Rifle and Las Pistol have upgrade variants (Remi)\n  \n  * Aetherium Fists added (Ashey)\n  \n  * Mount Gigant mission should appear on the new SAIL interface (zimberzimber)\n  \n  * adds a sprite to the capacity sensor that is different from the ITD (locketeerian)\n  \n  * limits both cap sensor and ITD to facing 'right' (locketeerian)\n  \n  * adds minimal clarification and differentiation between precursor tiles/blocks (locketeerian)\n\n_____________________________________________________\n  ^cyan;New in version 5.6.243^reset;\n  \n  * you can now craft Carbon in the Ingredients tab of the furnace\n  \n  * the Omega Hammer should properly register as Precursor for set bonuses.\n  \n  * Replaces hacky interfaceOpener with player.interact from 1.3.2  (xn-5o8h )\n  \n  * added the Bushmaster and Blast Buddy grenade launchers for tier 1 and 2.\n  \n  * upgrading the Bugnet in the Tool Upgrade Station should have more reasonable swing times and energy cost\n  \n  * boss creatures should no longer be capturable\n  \n  * all crew beds should properly unlock\n  \n  * corrected some recipes that relied on recently removed items\n  \n  * upgrade costs at the Tool Upgrade Station cost varying amounts depending on the tool\n  \n  * higher upgrades have higher manipulator costs, regardless of tool type.\n  \n_____________________________________________________\n  ^cyan;New in version 5.6.242^reset;\n  \n  * removed forgotten baseHeight values in certain ocean biomes. This should stop dark magma, tidewater and a select few others from being wonky.\n  \n  * Added 'fu_util.lua' script with extra utility functions (zimberzimber)\n  \n  * Modified 'currencies.config.patch' with extra data required by FU SAIL (This data has no effect outside of SAIL) (zimberzimber)\n  \n  * FU SAIL currency list now relies on currencies.config and the previously mentioned changes (zimberzimber)\n  \n  * Fixed AI not using the talking animation when printing mission descriptions (zimberzimber)\n  \n  * Fixed missions overlapping the buttons in the mission list when there are a lot of missions available (zimberzimber)\n\n  * Elithian Races items: Monster Hide, Monster Bone, Great Monster Bone, Monster Scales, Monster Claws, Monster Plate and Monster Spine can be converted into other resources in the Extractor\n  \n  * Cave and Ore detectors are now upgraded in the Tool Upgrade Station. The old t2 and t3 versions of these tools are now removed.\n  \n  * Auto-Hookshot now upgrades in the Tool Upgrade Station. The old upgrade versions were removed.\n  \n  * Relocators now upgrade in the Tool Upgrade station. old versions removed.\n  \n  * Parasols now upgrade in the Tool Upgrade Station\n  \n  * the Translocator now upgrades in the Tool Upgrade Station\n  \n  * added missing recipe/unlock for Gyrostabilizer\n  \n  * removed all old models of Mining Lasers\n  \n  * added various Crossbows\n  \n  * Prevents stack overflow on the S.A.I.L. interface when using vanilla ships. (xn-5o8h)\n  \n  * handling added to prevent errors in the update log from affecting techs and other script-based effects and gear (zimberzimber)\n  \n  * added timers to some invisible monster spawners that spawn bosses\n  \n_____________________________________________________\n  ^cyan;New in version 5.6.241^reset;\n  \n  * REGARDING NEW SAIL INTERFACE: if your Race mod 'Includes' FU (to force it to load after FU) it will *not* function with the new SAIL. This means Avali are screwed for now. However, we may opt to release an addon that loads after all the custom races to combat this issue. Have patience!\n    Note that this also means any race mod that loads after FU , in general, will have the same issue. \n  \n  * adds a few more races supported by new SAIL\n  \n  * Tool Upgrade Table now tells you the tools it works on, and the tools also inform you where they can be upgraded.\n  \n  * new armor set: Researcher. Unlocked by accessing a tier 2 or 3 Armory. (TimothyWiggins)\n  \n  * scripted AI lattice mod should properly function in tandem with FU SAIL\n\n  * added Ferozium, Violium and Aegisalt to the Precursor Duplicator output options.\n  \n  * Protectorate Broadsword upgrade added\n  \n  * adjusted upgrade name for the broken broadsword\n  \n  * adjusts racializer code (Hubnester)\n  \n  * adds more sloped glass blocks (SentientCookie)\n  \n_____________________________________________________\n  ^cyan;New in version 5.6.240^reset;\n\n  * added Huge, Mega, Mammoth and other large sizes back to other biome types besides Gas Giants. This applies to FU star types only. Starter systems have only as high as Huge worlds to prevent exorbitant travel times before gaining mobility Techs.\n  \n  * oceans should no longer generate to the atmosphere when generated as Small sized planets.\n  \n  * Avali, Blattra, Elithian Races and Felin should all have proper access to the new SAIL interface. As before, please inform if your race is not getting it so we can correct it.\n  \n_____________________________________________________\n  ^cyan;New in version 5.6.239^reset;\n\n  * new icons for space missions, stations etc (Rylasasin, me)\n  \n  * NEW : SAIL interface (zimberzimber). This should give you more info in-game as to your current status, as well as provide all the info SAIL previously did. Should be compatible with just about everything. If your race does not see a new SAIL console, let us know.\n  \n  * Pretty straightforward. Park ship on the orbit of planet, and Atmospheric Condenser will collect planetary resources, like it's built on the surface. (Vollch)\n  \n  * added delicious Face Skin\n  \n  * new gather/completion method for Precursor Dungeon and Delta Freya unlocks\n  \n  * added Sinco mech parts to FU. Thanks for permissions from Sinful Creature!\n  \n  * the MatMod Placer can now create Weather Protection mod, which will coat tiles and prevent them from picking up weather-based coatings appearing on tiles (Remi)\n  \n  * Made it effectively impossible to miss with bombs in the distortion sphere hall within the Dark Caverns. If you can't hit the door now, you have issues. I mean, c'mon guys...\n  \n  * added text nag for the above door just so there is absolutely no more confusion.\n  \n  * adds universe flag to techscientist4 quest , since it is normally set in 6, and 6 is no longer used. This should enable you to obtain the Tech Console, though the Tech Tablet is still better anyhow!\n  \n  * Core Spear is no longer missing primary attack sound\n  \n  * Dodge II has +7% Bash chance, and +2 distance to inflicted bashes\n  \n  * changed Dodge tech icons to be more distinct from Dash\n  \n  * Updates the ship sprite for the Tier 6, Tier 7 and Tier 8 Kirhos Ship (Gainem, Hubnester)\n  * THE IMAGE AND BLOCKS WILL NOT LINE UP WITH PREEXISTING TIER 5 or 8 KIRHOS SHIP (only ones that were at tier 5 or 8 before this update) \n  \n_____________________________________________________\n  ^cyan;New in version 5.6.238^reset;\n  \n  * Adds BYOS support for Slime Race and Elithian Races \n  \n  * Dodge II should be properly craftable\n  \n  \n_____________________________________________________\n  ^cyan;New in version 5.6.237^reset;\n\n  * Slight changes to the Dark Caverns to force a path through the dungeon\n  \n  * Apiary 'Mite Alarm' sound effect now only plays if an apiary has over 360 mites inside.\n  \n  * relocated unlock for Mech mining lasers to the Mech Drill II.\n  \n  * Elder Grappling Hook can now grant energy and shadow resist when extended. It also handles more efficiently.\n  \n  * Stormwarden should no longer spawn as PGI\n  \n  * Techs no longer display the 'chip' graphic type.\n  \n  * Phase Attack tech has been rebalanced\n    * it now bases power on *remaining* energy. As it drains your energy, its power increases.\n    * maximum boost is now much lower than previously.\n    \n  * the Dodge tech is less crappy!\n    * slightly increased distance\n    * provides a small defense boost while active\n    * provides +5% chance to Shield Bash and + 2 to Shield Bash distance\n    * cooldown increased from 0.2s to 0.25s\n    \n  * Dodge now has an upgrade that makes it even better!  \n  \n  * Blastcannon pistol has been rebalanced to not be impossibly good for Novakids when paired with FrackinRaces. \n    * It no longer provides both shotgun and pistol tags.\n    * Its damage is reduced by 0.5\n    * Its energy consumption is increased from 22 to 24\n    * It is slightly more accurate\n    \n_____________________________________________________\n  ^cyan;New in version 5.6.236^reset;\n  \n  * Mama Poptops babies no longer drop loot\n  \n  * the Nano-Tether is much more easily controlled\n  \n  * Dark Caverns: you can no longer get trapped by the vertical door by the lake\n  \n  * Evil Crunchy Chicks will no longer cause crashes when you devour them like the soulless, black-hearted monster you are.\n  \n_____________________________________________________\n  ^cyan;New in version 5.6.235^reset;\n  \n  * Dark Caverns dungeon entrance on Lush biomes no longer appears in the mines, and instead generates on the planet surface. This should hopefully stop it failing the generate, and allow it to be a bit more interesting to come across.\n  \n  * Dark Caverns dungeon now presents you with the Distortion Sphere\n  \n  * Dark Caverns has been adjusted to be more puzzle-y\n  \n  * Outpost tech scientist no longer offers the DistortionSphere tech/mission\n  \n  * Ice Wastes no longer generate the weird 'wtf ice field' terrain type. Dark Ice Wastes, however, still do. This terrain type has been slightly changed, however, and should have a couple variants\n  \n  * commented out unused checkArmor in bear sets. using it woulda caused an error due to lack of level variable. (kherae)\n\n  * elder set damage bonus swapped to effectiveMultiplier (kherae)\n\n  * setbonuses_common now correctly handles effectiveMultiplier, instead of ignoring it. Result...enforcer OP with increased 40% total output, instead of 20%. suggest nerf. same follows for most sets using effectiveMultiplier now. They need retuning to more manageable numbers. (kherae)\n\n  * converted numerous ranged weapon animation files into a single all-purpose file. This shouldn't impact you, but you might experience a eof once before it rights itself.\n  \n  * new look for Incinerator and its upgrades, Nomad Assault Rifle, Nomad Sniper Rifle and the Gauss set (TimothyWiggins)\n  \n  * Nomad Assault Rifle and Nomad Sniper Rifle now have upgrades\n  \n  * Silicon Boards require 1 less Silicon\n  \n  * Mining Bench requires Tungsten rather than Iron to craft\n    \n  * RENAME: Mining Bench is now known as the Tool Upgrade Table\n  \n  * Increased upgrade cost in Tool Upgrade Table by +1 Manipulator Module per tier. At 3 per tier, your total cost to reach tier 8 should be roughly 108.\n  \n  * some minor corrections to the Tool Upgrade Table script\n  \n  * You can now upgrade Mech Repair Tools in the Tool Upgrade Table\n  \n  * you can now extract your old mining lasers and mech repair guns in exchange for MM modules\n\n  * Superior Bug Net is now obtained via upgrading the net in the Tool Upgrade Table, rather than as a separate recipe. It can be upgraded one further time to become the Ultra Bug Net.\n  \n  * labtable and simple teleporter have corrected collision (TimothyWiggins127)\n  \n  * damagebonus status effects swapped to multiplicative modifier\n  \n  * Spacefarer and Spacefarer Adv armors display the proper bonuses (Zero-G Immunity removed, as it hasnt been on the armor for months! my bad!)\n  \n  * Fixed foodgoods item giving electronicgoods currency (zimberzimber)\n  \n  * fu_generic* proper fix (variables needed to be local. (kherae)\n\n  * there's now a dummy effect that can be applied to block movement abilities. (kherae)\n  \n  * removed unused variable bounds from shadowgasfx and shadowgasfx2 (kherae)\n  \n_____________________________________________________\n  ^cyan;New in version 5.6.234^reset;\n  \n  * mining laser base model should properly unlock on tinkertable access\n  \n  * mining bench should properly consume modules\n_____________________________________________________\n  ^cyan;New in version 5.6.233^reset;\n  \n  * Mining Laser revamp: Rather than make several versions of mining lasers, upgraded at in a nanofabricator, and then upgraded in a mining bench, all Mining Lasers now stem from the basic model. They no longer upgrade in crucibles, but still upgrade as before within the Mining Bench. \n    * note that the old models remain, for now, but will not for much longer. You will not be able to craft them any longer.\n  \n  * Mining Bench now uses Manipulator Modules once more\n  \n  * damage bonuses on Armor Sets and Battle Packs have been changed to work multiplicatively. Damage bonuses will perform better at higher tiers.\n  \n  * Berserker Unit augment now uses multiplicative damage bonuses\n  \n  * vanilla Damage augments nerfed by 50% to account for the above changes and maintain set balance\n  \n  * fixed a crash bug with Sour Milk and Bees\n  \n  * added a a_modders folder. Within you can find instructions for using some new features in FU in your own stuff. We'll be adding more to this as we go (zimberzimber)\n  \n"
    }
  }
]